SoCXin/HC32F4A0/src/hc32f4a0pgtb_template/common/hc32f4a0pgtb.h
/**
 * @brief INTC
 */
typedef struct
{
    __IO uint32_t NOCCR;
    __IO uint32_t NMIENR;
    __IO uint32_t NMIFR;
    __IO uint32_t NMICFR;
    __IO uint32_t EIRQCR0;
    __IO uint32_t EIRQCR1;
    __IO uint32_t EIRQCR2;
    __IO uint32_t EIRQCR3;
    __IO uint32_t EIRQCR4;
    __IO uint32_t EIRQCR5;
    __IO uint32_t EIRQCR6;
    __IO uint32_t EIRQCR7;
    __IO uint32_t EIRQCR8;
    __IO uint32_t EIRQCR9;
    __IO uint32_t EIRQCR10;
    __IO uint32_t EIRQCR11;
    __IO uint32_t EIRQCR12;
    __IO uint32_t EIRQCR13;
    __IO uint32_t EIRQCR14;
    __IO uint32_t EIRQCR15;
    __IO uint32_t WUPEN;
    __IO uint32_t EIFR;
    __IO uint32_t EICFR;
    __IO uint32_t SEL0;
    __IO uint32_t SEL1;
    __IO uint32_t SEL2;
    __IO uint32_t SEL3;
    __IO uint32_t SEL4;
    __IO uint32_t SEL5;
    __IO uint32_t SEL6;
    __IO uint32_t SEL7;
    __IO uint32_t SEL8;
    __IO uint32_t SEL9;
    __IO uint32_t SEL10;
    __IO uint32_t SEL11;
    __IO uint32_t SEL12;
    __IO uint32_t SEL13;
    __IO uint32_t SEL14;
    __IO uint32_t SEL15;
    __IO uint32_t SEL16;
    __IO uint32_t SEL17;
    __IO uint32_t SEL18;
    __IO uint32_t SEL19;
    __IO uint32_t SEL20;
    __IO uint32_t SEL21;
    __IO uint32_t SEL22;
    __IO uint32_t SEL23;
    __IO uint32_t SEL24;
    __IO uint32_t SEL25;
    __IO uint32_t SEL26;
    __IO uint32_t SEL27;
    __IO uint32_t SEL28;
    __IO uint32_t SEL29;
    __IO uint32_t SEL30;
    __IO uint32_t SEL31;
    __IO uint32_t SEL32;
    __IO uint32_t SEL33;
    __IO uint32_t SEL34;
    __IO uint32_t SEL35;
    __IO uint32_t SEL36;
    __IO uint32_t SEL37;
    __IO uint32_t SEL38;
    __IO uint32_t SEL39;
    __IO uint32_t SEL40;
    __IO uint32_t SEL41;
    __IO uint32_t SEL42;
    __IO uint32_t SEL43;
    __IO uint32_t SEL44;
    __IO uint32_t SEL45;
    __IO uint32_t SEL46;
    __IO uint32_t SEL47;
    __IO uint32_t SEL48;
    __IO uint32_t SEL49;
    __IO uint32_t SEL50;
    __IO uint32_t SEL51;
    __IO uint32_t SEL52;
    __IO uint32_t SEL53;
    __IO uint32_t SEL54;
    __IO uint32_t SEL55;
    __IO uint32_t SEL56;
    __IO uint32_t SEL57;
    __IO uint32_t SEL58;
    __IO uint32_t SEL59;
    __IO uint32_t SEL60;
    __IO uint32_t SEL61;
    __IO uint32_t SEL62;
    __IO uint32_t SEL63;
    __IO uint32_t SEL64;
    __IO uint32_t SEL65;
    __IO uint32_t SEL66;
    __IO uint32_t SEL67;
    __IO uint32_t SEL68;
    __IO uint32_t SEL69;
    __IO uint32_t SEL70;
    __IO uint32_t SEL71;
    __IO uint32_t SEL72;
    __IO uint32_t SEL73;
    __IO uint32_t SEL74;
    __IO uint32_t SEL75;
    __IO uint32_t SEL76;
    __IO uint32_t SEL77;
    __IO uint32_t SEL78;
    __IO uint32_t SEL79;
    __IO uint32_t SEL80;
    __IO uint32_t SEL81;
    __IO uint32_t SEL82;
    __IO uint32_t SEL83;
    __IO uint32_t SEL84;
    __IO uint32_t SEL85;
    __IO uint32_t SEL86;
    __IO uint32_t SEL87;
    __IO uint32_t SEL88;
    __IO uint32_t SEL89;
    __IO uint32_t SEL90;
    __IO uint32_t SEL91;
    __IO uint32_t SEL92;
    __IO uint32_t SEL93;
    __IO uint32_t SEL94;
    __IO uint32_t SEL95;
    __IO uint32_t SEL96;
    __IO uint32_t SEL97;
    __IO uint32_t SEL98;
    __IO uint32_t SEL99;
    __IO uint32_t SEL100;
    __IO uint32_t SEL101;
    __IO uint32_t SEL102;
    __IO uint32_t SEL103;
    __IO uint32_t SEL104;
    __IO uint32_t SEL105;
    __IO uint32_t SEL106;
    __IO uint32_t SEL107;
    __IO uint32_t SEL108;
    __IO uint32_t SEL109;
    __IO uint32_t SEL110;
    __IO uint32_t SEL111;
    __IO uint32_t SEL112;
    __IO uint32_t SEL113;
    __IO uint32_t SEL114;
    __IO uint32_t SEL115;
    __IO uint32_t SEL116;
    __IO uint32_t SEL117;
    __IO uint32_t SEL118;
    __IO uint32_t SEL119;
    __IO uint32_t SEL120;
    __IO uint32_t SEL121;
    __IO uint32_t SEL122;
    __IO uint32_t SEL123;
    __IO uint32_t SEL124;
    __IO uint32_t SEL125;
    __IO uint32_t SEL126;
    __IO uint32_t SEL127;
    __IO uint32_t VSSEL128;
    __IO uint32_t VSSEL129;
    __IO uint32_t VSSEL130;
    __IO uint32_t VSSEL131;
    __IO uint32_t VSSEL132;
    __IO uint32_t VSSEL133;
    __IO uint32_t VSSEL134;
    __IO uint32_t VSSEL135;
    __IO uint32_t VSSEL136;
    __IO uint32_t VSSEL137;
    __IO uint32_t VSSEL138;
    __IO uint32_t VSSEL139;
    __IO uint32_t VSSEL140;
    __IO uint32_t VSSEL141;
    __IO uint32_t VSSEL142;
    __IO uint32_t VSSEL143;
    __IO uint32_t SWIER;
    __IO uint32_t EVTER;
    __IO uint32_t IER;
} M4_INTC_TypeDef;

/**
 * @brief KEYSCAN
 */
typedef struct
{
    __IO uint32_t SCR;
    __IO uint32_t SER;
    __IO uint32_t SSR;
} M4_KEYSCAN_TypeDef;

/**
 * @brief MAU
 */
typedef struct
{
    __IO uint32_t CSR;
    __IO uint32_t DTR0;
    uint8_t RESERVED0[4];
    __IO uint32_t RTR0;
    __IO uint32_t DTR1;
    __IO uint32_t RTR1;
} M4_MAU_TypeDef;

/**
 * @brief MPU
 */
typedef struct
{
    __IO uint32_t RGD0;
    __IO uint32_t RGD1;
    __IO uint32_t RGD2;
    __IO uint32_t RGD3;
    __IO uint32_t RGD4;
    __IO uint32_t RGD5;
    __IO uint32_t RGD6;
    __IO uint32_t RGD7;
    __IO uint32_t RGD8;
    __IO uint32_t RGD9;
    __IO uint32_t RGD10;
    __IO uint32_t RGD11;
    __IO uint32_t RGD12;
    __IO uint32_t RGD13;
    __IO uint32_t RGD14;
    __IO uint32_t RGD15;
    __IO uint32_t SR;
    __IO uint32_t ECLR;
    __IO uint32_t WP;
    __IO uint32_t IPPR;
    __IO uint32_t S1RGE;
    __IO uint32_t S1RGWP;
    __IO uint32_t S1RGRP;
    __IO uint32_t S1CR;
    __IO uint32_t S2RGE;
    __IO uint32_t S2RGWP;
    __IO uint32_t S2RGRP;
    __IO uint32_t S2CR;
    __IO uint32_t FRGE;
    __IO uint32_t FRGWP;
    __IO uint32_t FRGRP;
    __IO uint32_t FCR;
    __IO uint32_t HRGE;
    __IO uint32_t HRGWP;
    __IO uint32_t HRGRP;
    __IO uint32_t HCR;
    __IO uint32_t ERGE;
    __IO uint32_t ERGWP;
    __IO uint32_t ERGRP;
    __IO uint32_t ECR;
} M4_MPU_TypeDef;

/**
 * @brief NFC
 */
typedef struct
{
    __IO uint32_t DATR_BASE;
    uint8_t RESERVED0[32764];
    __IO uint32_t CMDR;
    __IO uint32_t IDXR0;
    uint8_t RESERVED1[40];
    __IO uint32_t IENR;
    __IO uint32_t ISTR;
    __IO uint32_t IRSR;
    uint8_t RESERVED2[12];
    __IO uint32_t IDXR1;
    __IO uint32_t TMCR0;
    __IO uint32_t TMCR1;
    __IO uint32_t BACR;
    uint8_t RESERVED3[4];
    __IO uint32_t TMCR2;
    __IO uint32_t ECCR0;
    __IO uint32_t ECCR1;
    __IO uint32_t ECCR2;
    __IO uint32_t ECCR3;
    __IO uint32_t ECCR4;
    __IO uint32_t ECCR5;
    __IO uint32_t ECCR6;
    __IO uint32_t ECC_STAT;
    __IO uint32_t ECC_SYND0_0;
    __IO uint32_t ECC_SYND0_1;
    __IO uint32_t ECC_SYND0_2;
    __IO uint32_t ECC_SYND0_3;
    __IO uint32_t ECC_SYND1_0;
    __IO uint32_t ECC_SYND1_1;
    __IO uint32_t ECC_SYND1_2;
    __IO uint32_t ECC_SYND1_3;
    __IO uint32_t ECC_SYND2_0;
    __IO uint32_t ECC_SYND2_1;
    __IO uint32_t ECC_SYND2_2;
    __IO uint32_t ECC_SYND2_3;
    __IO uint32_t ECC_SYND3_0;
    __IO uint32_t ECC_SYND3_1;
    __IO uint32_t ECC_SYND3_2;
    __IO uint32_t ECC_SYND3_3;
    __IO uint32_t ECC_SYND4_0;
    __IO uint32_t ECC_SYND4_1;
    __IO uint32_t ECC_SYND4_2;
    __IO uint32_t ECC_SYND4_3;
    __IO uint32_t ECC_SYND5_0;
    __IO uint32_t ECC_SYND5_1;
    __IO uint32_t ECC_SYND5_2;
    __IO uint32_t ECC_SYND5_3;
    __IO uint32_t ECC_SYND6_0;
    __IO uint32_t ECC_SYND6_1;
    __IO uint32_t ECC_SYND6_2;
    __IO uint32_t ECC_SYND6_3;
    __IO uint32_t ECC_SYND7_0;
    __IO uint32_t ECC_SYND7_1;
    __IO uint32_t ECC_SYND7_2;
    __IO uint32_t ECC_SYND7_3;
    __IO uint32_t ECC_SYND8_0;
    __IO uint32_t ECC_SYND8_1;
    __IO uint32_t ECC_SYND8_2;
    __IO uint32_t ECC_SYND8_3;
    __IO uint32_t ECC_SYND9_0;
    __IO uint32_t ECC_SYND9_1;
    __IO uint32_t ECC_SYND9_2;
    __IO uint32_t ECC_SYND9_3;
    __IO uint32_t ECC_SYND10_0;
    __IO uint32_t ECC_SYND10_1;
    __IO uint32_t ECC_SYND10_2;
    __IO uint32_t ECC_SYND10_3;
    __IO uint32_t ECC_SYND11_0;
    __IO uint32_t ECC_SYND11_1;
    __IO uint32_t ECC_SYND11_2;
    __IO uint32_t ECC_SYND11_3;
    __IO uint32_t ECC_SYND12_0;
    __IO uint32_t ECC_SYND12_1;
    __IO uint32_t ECC_SYND12_2;
    __IO uint32_t ECC_SYND12_3;
    __IO uint32_t ECC_SYND13_0;
    __IO uint32_t ECC_SYND13_1;
    __IO uint32_t ECC_SYND13_2;
    __IO uint32_t ECC_SYND13_3;
    __IO uint32_t ECC_SYND14_0;
    __IO uint32_t ECC_SYND14_1;
    __IO uint32_t ECC_SYND14_2;
    __IO uint32_t ECC_SYND14_3;
    __IO uint32_t ECC_SYND15_0;
    __IO uint32_t ECC_SYND15_1;
    __IO uint32_t ECC_SYND15_2;
    __IO uint32_t ECC_SYND15_3;
} M4_NFC_TypeDef;

/**
 * @brief OTS
 */
typedef struct
{
    uint8_t RESERVED0[224];
    __IO uint32_t PDR1;
    uint8_t RESERVED1[16];
    __IO uint32_t PDR2;
    __IO uint32_t PDR3;
    uint8_t RESERVED2[237828];
    __IO uint16_t CTL;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t ECR;
    __IO uint32_t LPR;
} M4_OTS_TypeDef;

/**
 * @brief PERIC
 */
typedef struct
{
    __IO uint32_t USB_SYCTLREG;
    __IO uint32_t SDIOC_SYCTLREG;
    __IO uint32_t NFC_STCR;
    union
    {
        __IO uint32_t NFC_ENAR;
        __IO uint32_t SMC_ENAR;
        __IO uint32_t DMC_ENAR;
    };
    uint8_t RESERVED0[12];
    __IO uint32_t USART1_NFC;
    uint8_t RESERVED1[8];
    __IO uint32_t NFC_STSR;
} M4_PERIC_TypeDef;

/**
 * @brief PWC
 */
typedef struct
{
    __IO uint32_t FCG0;
    __IO uint32_t FCG1;
    __IO uint32_t FCG2;
    __IO uint32_t FCG3;
    __IO uint32_t FCG0PC;
    uint8_t RESERVED0[17436];
    __IO uint8_t  VBATRSTR;
    uint8_t RESERVED1[15];
    __IO uint8_t  VBATCR;
    uint8_t RESERVED2[15];
    __IO uint8_t  WKTC0;
    uint8_t RESERVED3[3];
    __IO uint8_t  WKTC1;
    uint8_t RESERVED4[3];
    __IO uint8_t  WKTC2;
    uint8_t RESERVED5[423];
    __IO uint8_t  BKR0;
    uint8_t RESERVED6[3];
    __IO uint8_t  BKR1;
    uint8_t RESERVED7[3];
    __IO uint8_t  BKR2;
    uint8_t RESERVED8[3];
    __IO uint8_t  BKR3;
    uint8_t RESERVED9[3];
    __IO uint8_t  BKR4;
    uint8_t RESERVED10[3];
    __IO uint8_t  BKR5;
    uint8_t RESERVED11[3];
    __IO uint8_t  BKR6;
    uint8_t RESERVED12[3];
    __IO uint8_t  BKR7;
    uint8_t RESERVED13[3];
    __IO uint8_t  BKR8;
    uint8_t RESERVED14[3];
    __IO uint8_t  BKR9;
    uint8_t RESERVED15[3];
    __IO uint8_t  BKR10;
    uint8_t RESERVED16[3];
    __IO uint8_t  BKR11;
    uint8_t RESERVED17[3];
    __IO uint8_t  BKR12;
    uint8_t RESERVED18[3];
    __IO uint8_t  BKR13;
    uint8_t RESERVED19[3];
    __IO uint8_t  BKR14;
    uint8_t RESERVED20[3];
    __IO uint8_t  BKR15;
    uint8_t RESERVED21[3];
    __IO uint8_t  BKR16;
    uint8_t RESERVED22[3];
    __IO uint8_t  BKR17;
    uint8_t RESERVED23[3];
    __IO uint8_t  BKR18;
    uint8_t RESERVED24[3];
    __IO uint8_t  BKR19;
    uint8_t RESERVED25[3];
    __IO uint8_t  BKR20;
    uint8_t RESERVED26[3];
    __IO uint8_t  BKR21;
    uint8_t RESERVED27[3];
    __IO uint8_t  BKR22;
    uint8_t RESERVED28[3];
    __IO uint8_t  BKR23;
    uint8_t RESERVED29[3];
    __IO uint8_t  BKR24;
    uint8_t RESERVED30[3];
    __IO uint8_t  BKR25;
    uint8_t RESERVED31[3];
    __IO uint8_t  BKR26;
    uint8_t RESERVED32[3];
    __IO uint8_t  BKR27;
    uint8_t RESERVED33[3];
    __IO uint8_t  BKR28;
    uint8_t RESERVED34[3];
    __IO uint8_t  BKR29;
    uint8_t RESERVED35[3];
    __IO uint8_t  BKR30;
    uint8_t RESERVED36[3];
    __IO uint8_t  BKR31;
    uint8_t RESERVED37[3];
    __IO uint8_t  BKR32;
    uint8_t RESERVED38[3];
    __IO uint8_t  BKR33;
    uint8_t RESERVED39[3];
    __IO uint8_t  BKR34;
    uint8_t RESERVED40[3];
    __IO uint8_t  BKR35;
    uint8_t RESERVED41[3];
    __IO uint8_t  BKR36;
    uint8_t RESERVED42[3];
    __IO uint8_t  BKR37;
    uint8_t RESERVED43[3];
    __IO uint8_t  BKR38;
    uint8_t RESERVED44[3];
    __IO uint8_t  BKR39;
    uint8_t RESERVED45[3];
    __IO uint8_t  BKR40;
    uint8_t RESERVED46[3];
    __IO uint8_t  BKR41;
    uint8_t RESERVED47[3];
    __IO uint8_t  BKR42;
    uint8_t RESERVED48[3];
    __IO uint8_t  BKR43;
    uint8_t RESERVED49[3];
    __IO uint8_t  BKR44;
    uint8_t RESERVED50[3];
    __IO uint8_t  BKR45;
    uint8_t RESERVED51[3];
    __IO uint8_t  BKR46;
    uint8_t RESERVED52[3];
    __IO uint8_t  BKR47;
    uint8_t RESERVED53[3];
    __IO uint8_t  BKR48;
    uint8_t RESERVED54[3];
    __IO uint8_t  BKR49;
    uint8_t RESERVED55[3];
    __IO uint8_t  BKR50;
    uint8_t RESERVED56[3];
    __IO uint8_t  BKR51;
    uint8_t RESERVED57[3];
    __IO uint8_t  BKR52;
    uint8_t RESERVED58[3];
    __IO uint8_t  BKR53;
    uint8_t RESERVED59[3];
    __IO uint8_t  BKR54;
    uint8_t RESERVED60[3];
    __IO uint8_t  BKR55;
    uint8_t RESERVED61[3];
    __IO uint8_t  BKR56;
    uint8_t RESERVED62[3];
    __IO uint8_t  BKR57;
    uint8_t RESERVED63[3];
    __IO uint8_t  BKR58;
    uint8_t RESERVED64[3];
    __IO uint8_t  BKR59;
    uint8_t RESERVED65[3];
    __IO uint8_t  BKR60;
    uint8_t RESERVED66[3];
    __IO uint8_t  BKR61;
    uint8_t RESERVED67[3];
    __IO uint8_t  BKR62;
    uint8_t RESERVED68[3];
    __IO uint8_t  BKR63;
    uint8_t RESERVED69[3];
    __IO uint8_t  BKR64;
    uint8_t RESERVED70[3];
    __IO uint8_t  BKR65;
    uint8_t RESERVED71[3];
    __IO uint8_t  BKR66;
    uint8_t RESERVED72[3];
    __IO uint8_t  BKR67;
    uint8_t RESERVED73[3];
    __IO uint8_t  BKR68;
    uint8_t RESERVED74[3];
    __IO uint8_t  BKR69;
    uint8_t RESERVED75[3];
    __IO uint8_t  BKR70;
    uint8_t RESERVED76[3];
    __IO uint8_t  BKR71;
    uint8_t RESERVED77[3];
    __IO uint8_t  BKR72;
    uint8_t RESERVED78[3];
    __IO uint8_t  BKR73;
    uint8_t RESERVED79[3];
    __IO uint8_t  BKR74;
    uint8_t RESERVED80[3];
    __IO uint8_t  BKR75;
    uint8_t RESERVED81[3];
    __IO uint8_t  BKR76;
    uint8_t RESERVED82[3];
    __IO uint8_t  BKR77;
    uint8_t RESERVED83[3];
    __IO uint8_t  BKR78;
    uint8_t RESERVED84[3];
    __IO uint8_t  BKR79;
    uint8_t RESERVED85[3];
    __IO uint8_t  BKR80;
    uint8_t RESERVED86[3];
    __IO uint8_t  BKR81;
    uint8_t RESERVED87[3];
    __IO uint8_t  BKR82;
    uint8_t RESERVED88[3];
    __IO uint8_t  BKR83;
    uint8_t RESERVED89[3];
    __IO uint8_t  BKR84;
    uint8_t RESERVED90[3];
    __IO uint8_t  BKR85;
    uint8_t RESERVED91[3];
    __IO uint8_t  BKR86;
    uint8_t RESERVED92[3];
    __IO uint8_t  BKR87;
    uint8_t RESERVED93[3];
    __IO uint8_t  BKR88;
    uint8_t RESERVED94[3];
    __IO uint8_t  BKR89;
    uint8_t RESERVED95[3];
    __IO uint8_t  BKR90;
    uint8_t RESERVED96[3];
    __IO uint8_t  BKR91;
    uint8_t RESERVED97[3];
    __IO uint8_t  BKR92;
    uint8_t RESERVED98[3];
    __IO uint8_t  BKR93;
    uint8_t RESERVED99[3];
    __IO uint8_t  BKR94;
    uint8_t RESERVED100[3];
    __IO uint8_t  BKR95;
    uint8_t RESERVED101[3];
    __IO uint8_t  BKR96;
    uint8_t RESERVED102[3];
    __IO uint8_t  BKR97;
    uint8_t RESERVED103[3];
    __IO uint8_t  BKR98;
    uint8_t RESERVED104[3];
    __IO uint8_t  BKR99;
    uint8_t RESERVED105[3];
    __IO uint8_t  BKR100;
    uint8_t RESERVED106[3];
    __IO uint8_t  BKR101;
    uint8_t RESERVED107[3];
    __IO uint8_t  BKR102;
    uint8_t RESERVED108[3];
    __IO uint8_t  BKR103;
    uint8_t RESERVED109[3];
    __IO uint8_t  BKR104;
    uint8_t RESERVED110[3];
    __IO uint8_t  BKR105;
    uint8_t RESERVED111[3];
    __IO uint8_t  BKR106;
    uint8_t RESERVED112[3];
    __IO uint8_t  BKR107;
    uint8_t RESERVED113[3];
    __IO uint8_t  BKR108;
    uint8_t RESERVED114[3];
    __IO uint8_t  BKR109;
    uint8_t RESERVED115[3];
    __IO uint8_t  BKR110;
    uint8_t RESERVED116[3];
    __IO uint8_t  BKR111;
    uint8_t RESERVED117[3];
    __IO uint8_t  BKR112;
    uint8_t RESERVED118[3];
    __IO uint8_t  BKR113;
    uint8_t RESERVED119[3];
    __IO uint8_t  BKR114;
    uint8_t RESERVED120[3];
    __IO uint8_t  BKR115;
    uint8_t RESERVED121[3];
    __IO uint8_t  BKR116;
    uint8_t RESERVED122[3];
    __IO uint8_t  BKR117;
    uint8_t RESERVED123[3];
    __IO uint8_t  BKR118;
    uint8_t RESERVED124[3];
    __IO uint8_t  BKR119;
    uint8_t RESERVED125[3];
    __IO uint8_t  BKR120;
    uint8_t RESERVED126[3];
    __IO uint8_t  BKR121;
    uint8_t RESERVED127[3];
    __IO uint8_t  BKR122;
    uint8_t RESERVED128[3];
    __IO uint8_t  BKR123;
    uint8_t RESERVED129[3];
    __IO uint8_t  BKR124;
    uint8_t RESERVED130[3];
    __IO uint8_t  BKR125;
    uint8_t RESERVED131[3];
    __IO uint8_t  BKR126;
    uint8_t RESERVED132[3];
    __IO uint8_t  BKR127;
    uint8_t RESERVED133[1027];
    __IO uint8_t  PWRC0;
    uint8_t RESERVED134[3];
    __IO uint8_t  PWRC1;
    uint8_t RESERVED135[3];
    __IO uint8_t  PWRC2;
    uint8_t RESERVED136[3];
    __IO uint8_t  PWRC3;
    uint8_t RESERVED137[3];
    __IO uint8_t  PWRC4;
    uint8_t RESERVED138[3];
    __IO uint8_t  PVDCR0;
    uint8_t RESERVED139[3];
    __IO uint8_t  PVDCR1;
    uint8_t RESERVED140[3];
    __IO uint8_t  PVDFCR;
    uint8_t RESERVED141[3];
    __IO uint8_t  PVDLCR;
    uint8_t RESERVED142[7];
    __IO uint8_t  PDWKE0;
    uint8_t RESERVED143[3];
    __IO uint8_t  PDWKE1;
    uint8_t RESERVED144[3];
    __IO uint8_t  PDWKE2;
    uint8_t RESERVED145[3];
    __IO uint8_t  PDWKES;
    uint8_t RESERVED146[3];
    __IO uint8_t  PDWKF0;
    uint8_t RESERVED147[3];
    __IO uint8_t  PDWKF1;
    uint8_t RESERVED148[163];
    __IO uint32_t RAMPC0;
    __IO uint16_t RAMOPM;
    uint8_t RESERVED149[2];
    __IO uint32_t PRAMLPC;
    uint8_t RESERVED150[4];
    __IO uint8_t  PVDICR;
    uint8_t RESERVED151[3];
    __IO uint8_t  PVDDSR;
    uint8_t RESERVED152[29463];
    __IO uint16_t STPMCR;
    uint8_t RESERVED153[1008];
    __IO uint16_t FPRC;
} M4_PWC_TypeDef;

/**
 * @brief QSPI
 */
typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t CSCR;
    __IO uint32_t FCR;
    __IO uint32_t SR;
    __IO uint32_t DCOM;
    __IO uint32_t CCMD;
    __IO uint32_t XCMD;
    uint8_t RESERVED0[8];
    __IO uint32_t SR2;
    uint8_t RESERVED1[2012];
    __IO uint32_t EXAR;
} M4_QSPI_TypeDef;

/**
 * @brief RMU
 */
typedef struct
{
    uint8_t RESERVED0[248];
    __IO uint8_t  PRSTCR0;
    uint8_t RESERVED1[3];
    __IO uint32_t RSTF0;
} M4_RMU_TypeDef;

/**
 * @brief RTC
 */
typedef struct
{
    __IO uint8_t  CR0;
    uint8_t RESERVED0[3];
    __IO uint8_t  CR1;
    uint8_t RESERVED1[3];
    __IO uint8_t  CR2;
    uint8_t RESERVED2[3];
    __IO uint8_t  CR3;
    uint8_t RESERVED3[3];
    __IO uint8_t  SEC;
    uint8_t RESERVED4[3];
    __IO uint8_t  MIN;
    uint8_t RESERVED5[3];
    __IO uint8_t  HOUR;
    uint8_t RESERVED6[3];
    __IO uint8_t  WEEK;
    uint8_t RESERVED7[3];
    __IO uint8_t  DAY;
    uint8_t RESERVED8[3];
    __IO uint8_t  MON;
    uint8_t RESERVED9[3];
    __IO uint8_t  YEAR;
    uint8_t RESERVED10[3];
    __IO uint8_t  ALMMIN;
    uint8_t RESERVED11[3];
    __IO uint8_t  ALMHOUR;
    uint8_t RESERVED12[3];
    __IO uint8_t  ALMWEEK;
    uint8_t RESERVED13[3];
    __IO uint8_t  ERRCRH;
    uint8_t RESERVED14[3];
    __IO uint8_t  ERRCRL;
    uint8_t RESERVED15[3];
    __IO uint8_t  TPCR0;
    uint8_t RESERVED16[3];
    __IO uint8_t  TPCR1;
    uint8_t RESERVED17[3];
    __IO uint8_t  TPSR;
    uint8_t RESERVED18[3];
    __IO uint8_t  SECTP;
    uint8_t RESERVED19[3];
    __IO uint8_t  MINTP;
    uint8_t RESERVED20[3];
    __IO uint8_t  HOURTP;
    uint8_t RESERVED21[3];
    __IO uint8_t  DAYTP;
    uint8_t RESERVED22[3];
    __IO uint8_t  MONTP;
} M4_RTC_TypeDef;

/**
 * @brief SDIOC
 */
typedef struct
{
    uint8_t RESERVED0[4];
    __IO uint16_t BLKSIZE;
    __IO uint16_t BLKCNT;
    __IO uint16_t ARG0;
    __IO uint16_t ARG1;
    __IO uint16_t TRANSMODE;
    __IO uint16_t CMD;
    __IO uint16_t RESP0;
    __IO uint16_t RESP1;
    __IO uint16_t RESP2;
    __IO uint16_t RESP3;
    __IO uint16_t RESP4;
    __IO uint16_t RESP5;
    __IO uint16_t RESP6;
    __IO uint16_t RESP7;
    __IO uint16_t BUF0;
    __IO uint16_t BUF1;
    __IO uint32_t PSTAT;
    __IO uint8_t  HOSTCON;
    __IO uint8_t  PWRCON;
    __IO uint8_t  BLKGPCON;
    uint8_t RESERVED1[1];
    __IO uint16_t CLKCON;
    __IO uint8_t  TOUTCON;
    __IO uint8_t  SFTRST;
    __IO uint16_t NORINTST;
    __IO uint16_t ERRINTST;
    __IO uint16_t NORINTSTEN;
    __IO uint16_t ERRINTSTEN;
    __IO uint16_t NORINTSGEN;
    __IO uint16_t ERRINTSGEN;
    __IO uint16_t ATCERRST;
    uint8_t RESERVED2[18];
    __IO uint16_t FEA;
    __IO uint16_t FEE;
} M4_SDIOC_TypeDef;

/**
 * @brief SMC
 */
typedef struct
{
    __IO uint32_t STSR;
    uint8_t RESERVED0[4];
    __IO uint32_t STCR0;
    __IO uint32_t STCR1;
    __IO uint32_t CMDR;
    __IO uint32_t TMCR;
    __IO uint32_t CPCR;
    uint8_t RESERVED1[4];
    __IO uint32_t RFTR;
    uint8_t RESERVED2[220];
    __IO uint32_t TMSR0;
    __IO uint32_t CPSR0;
    uint8_t RESERVED3[24];
    __IO uint32_t TMSR1;
    __IO uint32_t CPSR1;
    uint8_t RESERVED4[24];
    __IO uint32_t TMSR2;
    __IO uint32_t CPSR2;
    uint8_t RESERVED5[24];
    __IO uint32_t TMSR3;
    __IO uint32_t CPSR3;
    uint8_t RESERVED6[152];
    __IO uint32_t BACR;
    uint8_t RESERVED7[4];
    __IO uint32_t CSCR0;
    __IO uint32_t CSCR1;
} M4_SMC_TypeDef;

/**
 * @brief SPI
 */
typedef struct
{
    __IO uint32_t DR;
    __IO uint32_t CR1;
    uint8_t RESERVED0[4];
    __IO uint32_t CFG1;
    uint8_t RESERVED1[4];
    __IO uint32_t SR;
    __IO uint32_t CFG2;
} M4_SPI_TypeDef;

/**
 * @brief SRAMC
 */
typedef struct
{
    __IO uint32_t WTCR;
    __IO uint32_t WTPR;
    __IO uint32_t CKCR;
    __IO uint32_t CKPR;
    __IO uint32_t CKSR;
} M4_SRAMC_TypeDef;

/**
 * @brief SWDT
 */
typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t RR;
} M4_SWDT_TypeDef;

/**
 * @brief TMR0
 */
typedef struct
{
    __IO uint32_t CNTAR;
    __IO uint32_t CNTBR;
    __IO uint32_t CMPAR;
    __IO uint32_t CMPBR;
    __IO uint32_t BCONR;
    __IO uint32_t STFLR;
} M4_TMR0_TypeDef;

/**
 * @brief TMR2
 */
typedef struct
{
    __IO uint32_t CNTAR;
    __IO uint32_t CNTBR;
    __IO uint32_t CMPAR;
    __IO uint32_t CMPBR;
    __IO uint32_t BCONR;
    __IO uint32_t ICONR;
    __IO uint32_t PCONR;
    __IO uint32_t HCONR;
    __IO uint32_t STFLR;
} M4_TMR2_TypeDef;

