SoCXin/HC32F4A0/src/hc32f4a0pgtb_template/common/hc32f4a0pgtb.h
/**
 * @brief TMR4
 */
typedef struct
{
    uint8_t RESERVED0[2];
    __IO uint16_t OCCRUH;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCRUL;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCRVH;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCRVL;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCRWH;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCRWL;
    __IO uint16_t OCSRU;
    __IO uint16_t OCERU;
    __IO uint16_t OCSRV;
    __IO uint16_t OCERV;
    __IO uint16_t OCSRW;
    __IO uint16_t OCERW;
    __IO uint16_t OCMRHUH;
    uint8_t RESERVED6[2];
    __IO uint32_t OCMRLUL;
    __IO uint16_t OCMRHVH;
    uint8_t RESERVED7[2];
    __IO uint32_t OCMRLVL;
    __IO uint16_t OCMRHWH;
    uint8_t RESERVED8[2];
    __IO uint32_t OCMRLWL;
    uint8_t RESERVED9[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED10[2];
    __IO uint16_t CNTR;
    __IO uint16_t CCSR;
    __IO uint16_t CVPR;
    uint8_t RESERVED11[54];
    __IO uint16_t PFSRU;
    __IO uint16_t PDARU;
    __IO uint16_t PDBRU;
    uint8_t RESERVED12[2];
    __IO uint16_t PFSRV;
    __IO uint16_t PDARV;
    __IO uint16_t PDBRV;
    uint8_t RESERVED13[2];
    __IO uint16_t PFSRW;
    __IO uint16_t PDARW;
    __IO uint16_t PDBRW;
    __IO uint16_t POCRU;
    uint8_t RESERVED14[2];
    __IO uint16_t POCRV;
    uint8_t RESERVED15[2];
    __IO uint16_t POCRW;
    uint8_t RESERVED16[2];
    __IO uint16_t RCSR;
    uint8_t RESERVED17[12];
    __IO uint16_t SCCRUH;
    uint8_t RESERVED18[2];
    __IO uint16_t SCCRUL;
    uint8_t RESERVED19[2];
    __IO uint16_t SCCRVH;
    uint8_t RESERVED20[2];
    __IO uint16_t SCCRVL;
    uint8_t RESERVED21[2];
    __IO uint16_t SCCRWH;
    uint8_t RESERVED22[2];
    __IO uint16_t SCCRWL;
    __IO uint16_t SCSRUH;
    __IO uint16_t SCMRUH;
    __IO uint16_t SCSRUL;
    __IO uint16_t SCMRUL;
    __IO uint16_t SCSRVH;
    __IO uint16_t SCMRVH;
    __IO uint16_t SCSRVL;
    __IO uint16_t SCMRVL;
    __IO uint16_t SCSRWH;
    __IO uint16_t SCMRWH;
    __IO uint16_t SCSRWL;
    __IO uint16_t SCMRWL;
    __IO uint32_t PSCR;
    __IO uint16_t SCER;
} M4_TMR4_TypeDef;

/**
 * @brief TMR6
 */
typedef struct
{
    __IO uint32_t CNTER;
    __IO uint32_t UPDAR;
    uint8_t RESERVED0[56];
    __IO uint32_t PERAR;
    __IO uint32_t PERBR;
    __IO uint32_t PERCR;
    uint8_t RESERVED1[52];
    __IO uint32_t GCMAR;
    __IO uint32_t GCMBR;
    __IO uint32_t GCMCR;
    __IO uint32_t GCMDR;
    __IO uint32_t GCMER;
    __IO uint32_t GCMFR;
    uint8_t RESERVED2[40];
    __IO uint32_t SCMAR;
    __IO uint32_t SCMBR;
    __IO uint32_t SCMCR;
    __IO uint32_t SCMDR;
    __IO uint32_t SCMER;
    __IO uint32_t SCMFR;
    uint8_t RESERVED3[40];
    __IO uint32_t DTUAR;
    __IO uint32_t DTDAR;
    __IO uint32_t DTUBR;
    __IO uint32_t DTDBR;
    uint8_t RESERVED4[48];
    __IO uint32_t GCONR;
    __IO uint32_t ICONR;
    __IO uint32_t BCONR;
    __IO uint32_t DCONR;
    uint8_t RESERVED5[4];
    __IO uint32_t PCNAR;
    __IO uint32_t PCNBR;
    __IO uint32_t FCNGR;
    __IO uint32_t VPERR;
    __IO uint32_t STFLR;
    uint8_t RESERVED6[24];
    __IO uint32_t HSTAR;
    __IO uint32_t HSTPR;
    __IO uint32_t HCLRR;
    __IO uint32_t HUPDR;
    __IO uint32_t HCPAR;
    __IO uint32_t HCPBR;
    __IO uint32_t HCUPR;
    __IO uint32_t HCDOR;
    uint8_t RESERVED7[588];
    __IO uint32_t FCNTR;
    __IO uint32_t SSTAR;
    __IO uint32_t SSTPR;
    __IO uint32_t SCLRR;
    __IO uint32_t SUPDR;
} M4_TMR6_TypeDef;

/**
 * @brief TMRA
 */
typedef struct
{
    __IO uint32_t CNTER;
    __IO uint32_t PERAR;
    uint8_t RESERVED0[56];
    __IO uint32_t CMPAR1;
    __IO uint32_t CMPAR2;
    __IO uint32_t CMPAR3;
    __IO uint32_t CMPAR4;
    uint8_t RESERVED1[48];
    __IO uint32_t BCSTR;
    __IO uint32_t HCONR;
    __IO uint32_t HCUPR;
    __IO uint32_t HCDOR;
    __IO uint32_t ICONR;
    __IO uint32_t ECONR;
    __IO uint32_t FCONR;
    __IO uint32_t STFLR;
    uint8_t RESERVED2[32];
    __IO uint32_t BCONR1;
    uint8_t RESERVED3[4];
    __IO uint32_t BCONR2;
    uint8_t RESERVED4[52];
    __IO uint32_t CCONR1;
    __IO uint32_t CCONR2;
    __IO uint32_t CCONR3;
    __IO uint32_t CCONR4;
    uint8_t RESERVED5[48];
    __IO uint32_t PCONR1;
    __IO uint32_t PCONR2;
    __IO uint32_t PCONR3;
    __IO uint32_t PCONR4;
} M4_TMRA_TypeDef;

/**
 * @brief TRNG
 */
typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t MR;
    uint8_t RESERVED0[4];
    __IO uint32_t DR0;
    __IO uint32_t DR1;
} M4_TRNG_TypeDef;

/**
 * @brief USART
 */
typedef struct
{
    __IO uint32_t SR;
    __IO uint32_t DR;
    __IO uint32_t BRR;
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    __IO uint32_t PR;
    __IO uint32_t LBMC;
} M4_USART_TypeDef;

/**
 * @brief USBFS
 */
typedef struct
{
    __IO uint32_t GVBUSCFG;
    uint8_t RESERVED0[4];
    __IO uint32_t GAHBCFG;
    __IO uint32_t GUSBCFG;
    __IO uint32_t GRSTCTL;
    __IO uint32_t GINTSTS;
    __IO uint32_t GINTMSK;
    __IO uint32_t GRXSTSR;
    __IO uint32_t GRXSTSP;
    __IO uint32_t GRXFSIZ;
    __IO uint32_t HNPTXFSIZ;
    __IO uint32_t HNPTXSTS;
    uint8_t RESERVED1[12];
    __IO uint32_t CID;
    uint8_t RESERVED2[20];
    __IO uint32_t GLPMCFG;
    uint8_t RESERVED3[168];
    __IO uint32_t HPTXFSIZ;
    __IO uint32_t DIEPTXF1;
    __IO uint32_t DIEPTXF2;
    __IO uint32_t DIEPTXF3;
    __IO uint32_t DIEPTXF4;
    __IO uint32_t DIEPTXF5;
    __IO uint32_t DIEPTXF6;
    __IO uint32_t DIEPTXF7;
    __IO uint32_t DIEPTXF8;
    __IO uint32_t DIEPTXF9;
    __IO uint32_t DIEPTXF10;
    __IO uint32_t DIEPTXF11;
    __IO uint32_t DIEPTXF12;
    __IO uint32_t DIEPTXF13;
    __IO uint32_t DIEPTXF14;
    __IO uint32_t DIEPTXF15;
    uint8_t RESERVED4[704];
    __IO uint32_t HCFG;
    __IO uint32_t HFIR;
    __IO uint32_t HFNUM;
    uint8_t RESERVED5[4];
    __IO uint32_t HPTXSTS;
    __IO uint32_t HAINT;
    __IO uint32_t HAINTMSK;
    uint8_t RESERVED6[36];
    __IO uint32_t HPRT;
    uint8_t RESERVED7[188];
    __IO uint32_t HCCHAR0;
    uint8_t RESERVED8[4];
    __IO uint32_t HCINT0;
    __IO uint32_t HCINTMSK0;
    __IO uint32_t HCTSIZ0;
    __IO uint32_t HCDMA0;
    uint8_t RESERVED9[8];
    __IO uint32_t HCCHAR1;
    uint8_t RESERVED10[4];
    __IO uint32_t HCINT1;
    __IO uint32_t HCINTMSK1;
    __IO uint32_t HCTSIZ1;
    __IO uint32_t HCDMA1;
    uint8_t RESERVED11[8];
    __IO uint32_t HCCHAR2;
    uint8_t RESERVED12[4];
    __IO uint32_t HCINT2;
    __IO uint32_t HCINTMSK2;
    __IO uint32_t HCTSIZ2;
    __IO uint32_t HCDMA2;
    uint8_t RESERVED13[8];
    __IO uint32_t HCCHAR3;
    uint8_t RESERVED14[4];
    __IO uint32_t HCINT3;
    __IO uint32_t HCINTMSK3;
    __IO uint32_t HCTSIZ3;
    __IO uint32_t HCDMA3;
    uint8_t RESERVED15[8];
    __IO uint32_t HCCHAR4;
    uint8_t RESERVED16[4];
    __IO uint32_t HCINT4;
    __IO uint32_t HCINTMSK4;
    __IO uint32_t HCTSIZ4;
    __IO uint32_t HCDMA4;
    uint8_t RESERVED17[8];
    __IO uint32_t HCCHAR5;
    uint8_t RESERVED18[4];
    __IO uint32_t HCINT5;
    __IO uint32_t HCINTMSK5;
    __IO uint32_t HCTSIZ5;
    __IO uint32_t HCDMA5;
    uint8_t RESERVED19[8];
    __IO uint32_t HCCHAR6;
    uint8_t RESERVED20[4];
    __IO uint32_t HCINT6;
    __IO uint32_t HCINTMSK6;
    __IO uint32_t HCTSIZ6;
    __IO uint32_t HCDMA6;
    uint8_t RESERVED21[8];
    __IO uint32_t HCCHAR7;
    uint8_t RESERVED22[4];
    __IO uint32_t HCINT7;
    __IO uint32_t HCINTMSK7;
    __IO uint32_t HCTSIZ7;
    __IO uint32_t HCDMA7;
    uint8_t RESERVED23[8];
    __IO uint32_t HCCHAR8;
    uint8_t RESERVED24[4];
    __IO uint32_t HCINT8;
    __IO uint32_t HCINTMSK8;
    __IO uint32_t HCTSIZ8;
    __IO uint32_t HCDMA8;
    uint8_t RESERVED25[8];
    __IO uint32_t HCCHAR9;
    uint8_t RESERVED26[4];
    __IO uint32_t HCINT9;
    __IO uint32_t HCINTMSK9;
    __IO uint32_t HCTSIZ9;
    __IO uint32_t HCDMA9;
    uint8_t RESERVED27[8];
    __IO uint32_t HCCHAR10;
    uint8_t RESERVED28[4];
    __IO uint32_t HCINT10;
    __IO uint32_t HCINTMSK10;
    __IO uint32_t HCTSIZ10;
    __IO uint32_t HCDMA10;
    uint8_t RESERVED29[8];
    __IO uint32_t HCCHAR11;
    uint8_t RESERVED30[4];
    __IO uint32_t HCINT11;
    __IO uint32_t HCINTMSK11;
    __IO uint32_t HCTSIZ11;
    __IO uint32_t HCDMA11;
    uint8_t RESERVED31[8];
    __IO uint32_t HCCHAR12;
    uint8_t RESERVED32[4];
    __IO uint32_t HCINT12;
    __IO uint32_t HCINTMSK12;
    __IO uint32_t HCTSIZ12;
    __IO uint32_t HCDMA12;
    uint8_t RESERVED33[8];
    __IO uint32_t HCCHAR13;
    uint8_t RESERVED34[4];
    __IO uint32_t HCINT13;
    __IO uint32_t HCINTMSK13;
    __IO uint32_t HCTSIZ13;
    __IO uint32_t HCDMA13;
    uint8_t RESERVED35[8];
    __IO uint32_t HCCHAR14;
    uint8_t RESERVED36[4];
    __IO uint32_t HCINT14;
    __IO uint32_t HCINTMSK14;
    __IO uint32_t HCTSIZ14;
    __IO uint32_t HCDMA14;
    uint8_t RESERVED37[8];
    __IO uint32_t HCCHAR15;
    uint8_t RESERVED38[4];
    __IO uint32_t HCINT15;
    __IO uint32_t HCINTMSK15;
    __IO uint32_t HCTSIZ15;
    __IO uint32_t HCDMA15;
    uint8_t RESERVED39[264];
    __IO uint32_t DCFG;
    __IO uint32_t DCTL;
    __IO uint32_t DSTS;
    uint8_t RESERVED40[4];
    __IO uint32_t DIEPMSK;
    __IO uint32_t DOEPMSK;
    __IO uint32_t DAINT;
    __IO uint32_t DAINTMSK;
    uint8_t RESERVED41[20];
    __IO uint32_t DIEPEMPMSK;
    uint8_t RESERVED42[200];
    __IO uint32_t DIEPCTL0;
    uint8_t RESERVED43[4];
    __IO uint32_t DIEPINT0;
    uint8_t RESERVED44[4];
    __IO uint32_t DIEPTSIZ0;
    __IO uint32_t DIEPDMA0;
    __IO uint32_t DTXFSTS0;
    uint8_t RESERVED45[4];
    __IO uint32_t DIEPCTL1;
    uint8_t RESERVED46[4];
    __IO uint32_t DIEPINT1;
    uint8_t RESERVED47[4];
    __IO uint32_t DIEPTSIZ1;
    __IO uint32_t DIEPDMA1;
    __IO uint32_t DTXFSTS1;
    uint8_t RESERVED48[4];
    __IO uint32_t DIEPCTL2;
    uint8_t RESERVED49[4];
    __IO uint32_t DIEPINT2;
    uint8_t RESERVED50[4];
    __IO uint32_t DIEPTSIZ2;
    __IO uint32_t DIEPDMA2;
    __IO uint32_t DTXFSTS2;
    uint8_t RESERVED51[4];
    __IO uint32_t DIEPCTL3;
    uint8_t RESERVED52[4];
    __IO uint32_t DIEPINT3;
    uint8_t RESERVED53[4];
    __IO uint32_t DIEPTSIZ3;
    __IO uint32_t DIEPDMA3;
    __IO uint32_t DTXFSTS3;
    uint8_t RESERVED54[4];
    __IO uint32_t DIEPCTL4;
    uint8_t RESERVED55[4];
    __IO uint32_t DIEPINT4;
    uint8_t RESERVED56[4];
    __IO uint32_t DIEPTSIZ4;
    __IO uint32_t DIEPDMA4;
    __IO uint32_t DTXFSTS4;
    uint8_t RESERVED57[4];
    __IO uint32_t DIEPCTL5;
    uint8_t RESERVED58[4];
    __IO uint32_t DIEPINT5;
    uint8_t RESERVED59[4];
    __IO uint32_t DIEPTSIZ5;
    __IO uint32_t DIEPDMA5;
    __IO uint32_t DTXFSTS5;
    uint8_t RESERVED60[4];
    __IO uint32_t DIEPCTL6;
    uint8_t RESERVED61[4];
    __IO uint32_t DIEPINT6;
    uint8_t RESERVED62[4];
    __IO uint32_t DIEPTSIZ6;
    __IO uint32_t DIEPDMA6;
    __IO uint32_t DTXFSTS6;
    uint8_t RESERVED63[4];
    __IO uint32_t DIEPCTL7;
    uint8_t RESERVED64[4];
    __IO uint32_t DIEPINT7;
    uint8_t RESERVED65[4];
    __IO uint32_t DIEPTSIZ7;
    __IO uint32_t DIEPDMA7;
    __IO uint32_t DTXFSTS7;
    uint8_t RESERVED66[4];
    __IO uint32_t DIEPCTL8;
    uint8_t RESERVED67[4];
    __IO uint32_t DIEPINT8;
    uint8_t RESERVED68[4];
    __IO uint32_t DIEPTSIZ8;
    __IO uint32_t DIEPDMA8;
    __IO uint32_t DTXFSTS8;
    uint8_t RESERVED69[4];
    __IO uint32_t DIEPCTL9;
    uint8_t RESERVED70[4];
    __IO uint32_t DIEPINT9;
    uint8_t RESERVED71[4];
    __IO uint32_t DIEPTSIZ9;
    __IO uint32_t DIEPDMA9;
    __IO uint32_t DTXFSTS9;
    uint8_t RESERVED72[4];
    __IO uint32_t DIEPCTL10;
    uint8_t RESERVED73[4];
    __IO uint32_t DIEPINT10;
    uint8_t RESERVED74[4];
    __IO uint32_t DIEPTSIZ10;
    __IO uint32_t DIEPDMA10;
    __IO uint32_t DTXFSTS10;
    uint8_t RESERVED75[4];
    __IO uint32_t DIEPCTL11;
    uint8_t RESERVED76[4];
    __IO uint32_t DIEPINT11;
    uint8_t RESERVED77[4];
    __IO uint32_t DIEPTSIZ11;
    __IO uint32_t DIEPDMA11;
    __IO uint32_t DTXFSTS11;
    uint8_t RESERVED78[4];
    __IO uint32_t DIEPCTL12;
    uint8_t RESERVED79[4];
    __IO uint32_t DIEPINT12;
    uint8_t RESERVED80[4];
    __IO uint32_t DIEPTSIZ12;
    __IO uint32_t DIEPDMA12;
    __IO uint32_t DTXFSTS12;
    uint8_t RESERVED81[4];
    __IO uint32_t DIEPCTL13;
    uint8_t RESERVED82[4];
    __IO uint32_t DIEPINT13;
    uint8_t RESERVED83[4];
    __IO uint32_t DIEPTSIZ13;
    __IO uint32_t DIEPDMA13;
    __IO uint32_t DTXFSTS13;
    uint8_t RESERVED84[4];
    __IO uint32_t DIEPCTL14;
    uint8_t RESERVED85[4];
    __IO uint32_t DIEPINT14;
    uint8_t RESERVED86[4];
    __IO uint32_t DIEPTSIZ14;
    __IO uint32_t DIEPDMA14;
    __IO uint32_t DTXFSTS14;
    uint8_t RESERVED87[4];
    __IO uint32_t DIEPCTL15;
    uint8_t RESERVED88[4];
    __IO uint32_t DIEPINT15;
    uint8_t RESERVED89[4];
    __IO uint32_t DIEPTSIZ15;
    __IO uint32_t DIEPDMA15;
    __IO uint32_t DTXFSTS15;
    uint8_t RESERVED90[4];
    __IO uint32_t DOEPCTL0;
    uint8_t RESERVED91[4];
    __IO uint32_t DOEPINT0;
    uint8_t RESERVED92[4];
    __IO uint32_t DOEPTSIZ0;
    __IO uint32_t DOEPDMA0;
    uint8_t RESERVED93[8];
    __IO uint32_t DOEPCTL1;
    uint8_t RESERVED94[4];
    __IO uint32_t DOEPINT1;
    uint8_t RESERVED95[4];
    __IO uint32_t DOEPTSIZ1;
    __IO uint32_t DOEPDMA1;
    uint8_t RESERVED96[8];
    __IO uint32_t DOEPCTL2;
    uint8_t RESERVED97[4];
    __IO uint32_t DOEPINT2;
    uint8_t RESERVED98[4];
    __IO uint32_t DOEPTSIZ2;
    __IO uint32_t DOEPDMA2;
    uint8_t RESERVED99[8];
    __IO uint32_t DOEPCTL3;
    uint8_t RESERVED100[4];
    __IO uint32_t DOEPINT3;
    uint8_t RESERVED101[4];
    __IO uint32_t DOEPTSIZ3;
    __IO uint32_t DOEPDMA3;
    uint8_t RESERVED102[8];
    __IO uint32_t DOEPCTL4;
    uint8_t RESERVED103[4];
    __IO uint32_t DOEPINT4;
    uint8_t RESERVED104[4];
    __IO uint32_t DOEPTSIZ4;
    __IO uint32_t DOEPDMA4;
    uint8_t RESERVED105[8];
    __IO uint32_t DOEPCTL5;
    uint8_t RESERVED106[4];
    __IO uint32_t DOEPINT5;
    uint8_t RESERVED107[4];
    __IO uint32_t DOEPTSIZ5;
    __IO uint32_t DOEPDMA5;
    uint8_t RESERVED108[8];
    __IO uint32_t DOEPCTL6;
    uint8_t RESERVED109[4];
    __IO uint32_t DOEPINT6;
    uint8_t RESERVED110[4];
    __IO uint32_t DOEPTSIZ6;
    __IO uint32_t DOEPDMA6;
    uint8_t RESERVED111[8];
    __IO uint32_t DOEPCTL7;
    uint8_t RESERVED112[4];
    __IO uint32_t DOEPINT7;
    uint8_t RESERVED113[4];
    __IO uint32_t DOEPTSIZ7;
    __IO uint32_t DOEPDMA7;
    uint8_t RESERVED114[8];
    __IO uint32_t DOEPCTL8;
    uint8_t RESERVED115[4];
    __IO uint32_t DOEPINT8;
    uint8_t RESERVED116[4];
    __IO uint32_t DOEPTSIZ8;
    __IO uint32_t DOEPDMA8;
    uint8_t RESERVED117[8];
    __IO uint32_t DOEPCTL9;
    uint8_t RESERVED118[4];
    __IO uint32_t DOEPINT9;
    uint8_t RESERVED119[4];
    __IO uint32_t DOEPTSIZ9;
    __IO uint32_t DOEPDMA9;
    uint8_t RESERVED120[8];
    __IO uint32_t DOEPCTL10;
    uint8_t RESERVED121[4];
    __IO uint32_t DOEPINT10;
    uint8_t RESERVED122[4];
    __IO uint32_t DOEPTSIZ10;
    __IO uint32_t DOEPDMA10;
    uint8_t RESERVED123[8];
    __IO uint32_t DOEPCTL11;
    uint8_t RESERVED124[4];
    __IO uint32_t DOEPINT11;
    uint8_t RESERVED125[4];
    __IO uint32_t DOEPTSIZ11;
    __IO uint32_t DOEPDMA11;
    uint8_t RESERVED126[8];
    __IO uint32_t DOEPCTL12;
    uint8_t RESERVED127[4];
    __IO uint32_t DOEPINT12;
    uint8_t RESERVED128[4];
    __IO uint32_t DOEPTSIZ12;
    __IO uint32_t DOEPDMA12;
    uint8_t RESERVED129[8];
    __IO uint32_t DOEPCTL13;
    uint8_t RESERVED130[4];
    __IO uint32_t DOEPINT13;
    uint8_t RESERVED131[4];
    __IO uint32_t DOEPTSIZ13;
    __IO uint32_t DOEPDMA13;
    uint8_t RESERVED132[8];
    __IO uint32_t DOEPCTL14;
    uint8_t RESERVED133[4];
    __IO uint32_t DOEPINT14;
    uint8_t RESERVED134[4];
    __IO uint32_t DOEPTSIZ14;
    __IO uint32_t DOEPDMA14;
    uint8_t RESERVED135[8];
    __IO uint32_t DOEPCTL15;
    uint8_t RESERVED136[4];
    __IO uint32_t DOEPINT15;
    uint8_t RESERVED137[4];
    __IO uint32_t DOEPTSIZ15;
    __IO uint32_t DOEPDMA15;
    uint8_t RESERVED138[264];
    __IO uint32_t GCCTL;
} M4_USBFS_TypeDef;

