SoCXin/HC32F4A0/src/hc32f4a0pgtb_template/common/hc32f4a0pgtb.h
/*  Bit definition for EFM_F1NWPRT0 register  */
#define EFM_F1NWPRT0_F1NWPRT0_POS                      (0U)
#define EFM_F1NWPRT0_F1NWPRT0                          (0x00000001UL)
#define EFM_F1NWPRT0_F1NWPRT1_POS                      (1U)
#define EFM_F1NWPRT0_F1NWPRT1                          (0x00000002UL)
#define EFM_F1NWPRT0_F1NWPRT2_POS                      (2U)
#define EFM_F1NWPRT0_F1NWPRT2                          (0x00000004UL)
#define EFM_F1NWPRT0_F1NWPRT3_POS                      (3U)
#define EFM_F1NWPRT0_F1NWPRT3                          (0x00000008UL)
#define EFM_F1NWPRT0_F1NWPRT4_POS                      (4U)
#define EFM_F1NWPRT0_F1NWPRT4                          (0x00000010UL)
#define EFM_F1NWPRT0_F1NWPRT5_POS                      (5U)
#define EFM_F1NWPRT0_F1NWPRT5                          (0x00000020UL)
#define EFM_F1NWPRT0_F1NWPRT6_POS                      (6U)
#define EFM_F1NWPRT0_F1NWPRT6                          (0x00000040UL)
#define EFM_F1NWPRT0_F1NWPRT7_POS                      (7U)
#define EFM_F1NWPRT0_F1NWPRT7                          (0x00000080UL)
#define EFM_F1NWPRT0_F1NWPRT8_POS                      (8U)
#define EFM_F1NWPRT0_F1NWPRT8                          (0x00000100UL)
#define EFM_F1NWPRT0_F1NWPRT9_POS                      (9U)
#define EFM_F1NWPRT0_F1NWPRT9                          (0x00000200UL)
#define EFM_F1NWPRT0_F1NWPRT10_POS                     (10U)
#define EFM_F1NWPRT0_F1NWPRT10                         (0x00000400UL)
#define EFM_F1NWPRT0_F1NWPRT11_POS                     (11U)
#define EFM_F1NWPRT0_F1NWPRT11                         (0x00000800UL)
#define EFM_F1NWPRT0_F1NWPRT12_POS                     (12U)
#define EFM_F1NWPRT0_F1NWPRT12                         (0x00001000UL)
#define EFM_F1NWPRT0_F1NWPRT13_POS                     (13U)
#define EFM_F1NWPRT0_F1NWPRT13                         (0x00002000UL)
#define EFM_F1NWPRT0_F1NWPRT14_POS                     (14U)
#define EFM_F1NWPRT0_F1NWPRT14                         (0x00004000UL)
#define EFM_F1NWPRT0_F1NWPRT15_POS                     (15U)
#define EFM_F1NWPRT0_F1NWPRT15                         (0x00008000UL)
#define EFM_F1NWPRT0_F1NWPRT16_POS                     (16U)
#define EFM_F1NWPRT0_F1NWPRT16                         (0x00010000UL)
#define EFM_F1NWPRT0_F1NWPRT17_POS                     (17U)
#define EFM_F1NWPRT0_F1NWPRT17                         (0x00020000UL)
#define EFM_F1NWPRT0_F1NWPRT18_POS                     (18U)
#define EFM_F1NWPRT0_F1NWPRT18                         (0x00040000UL)
#define EFM_F1NWPRT0_F1NWPRT19_POS                     (19U)
#define EFM_F1NWPRT0_F1NWPRT19                         (0x00080000UL)
#define EFM_F1NWPRT0_F1NWPRT20_POS                     (20U)
#define EFM_F1NWPRT0_F1NWPRT20                         (0x00100000UL)
#define EFM_F1NWPRT0_F1NWPRT21_POS                     (21U)
#define EFM_F1NWPRT0_F1NWPRT21                         (0x00200000UL)
#define EFM_F1NWPRT0_F1NWPRT22_POS                     (22U)
#define EFM_F1NWPRT0_F1NWPRT22                         (0x00400000UL)
#define EFM_F1NWPRT0_F1NWPRT23_POS                     (23U)
#define EFM_F1NWPRT0_F1NWPRT23                         (0x00800000UL)
#define EFM_F1NWPRT0_F1NWPRT24_POS                     (24U)
#define EFM_F1NWPRT0_F1NWPRT24                         (0x01000000UL)
#define EFM_F1NWPRT0_F1NWPRT25_POS                     (25U)
#define EFM_F1NWPRT0_F1NWPRT25                         (0x02000000UL)
#define EFM_F1NWPRT0_F1NWPRT26_POS                     (26U)
#define EFM_F1NWPRT0_F1NWPRT26                         (0x04000000UL)
#define EFM_F1NWPRT0_F1NWPRT27_POS                     (27U)
#define EFM_F1NWPRT0_F1NWPRT27                         (0x08000000UL)
#define EFM_F1NWPRT0_F1NWPRT28_POS                     (28U)
#define EFM_F1NWPRT0_F1NWPRT28                         (0x10000000UL)
#define EFM_F1NWPRT0_F1NWPRT29_POS                     (29U)
#define EFM_F1NWPRT0_F1NWPRT29                         (0x20000000UL)
#define EFM_F1NWPRT0_F1NWPRT30_POS                     (30U)
#define EFM_F1NWPRT0_F1NWPRT30                         (0x40000000UL)
#define EFM_F1NWPRT0_F1NWPRT31_POS                     (31U)
#define EFM_F1NWPRT0_F1NWPRT31                         (0x80000000UL)

/*  Bit definition for EFM_F1NWPRT1 register  */
#define EFM_F1NWPRT1_F1NWPRT32_POS                     (0U)
#define EFM_F1NWPRT1_F1NWPRT32                         (0x00000001UL)
#define EFM_F1NWPRT1_F1NWPRT33_POS                     (1U)
#define EFM_F1NWPRT1_F1NWPRT33                         (0x00000002UL)
#define EFM_F1NWPRT1_F1NWPRT34_POS                     (2U)
#define EFM_F1NWPRT1_F1NWPRT34                         (0x00000004UL)
#define EFM_F1NWPRT1_F1NWPRT35_POS                     (3U)
#define EFM_F1NWPRT1_F1NWPRT35                         (0x00000008UL)
#define EFM_F1NWPRT1_F1NWPRT36_POS                     (4U)
#define EFM_F1NWPRT1_F1NWPRT36                         (0x00000010UL)
#define EFM_F1NWPRT1_F1NWPRT37_POS                     (5U)
#define EFM_F1NWPRT1_F1NWPRT37                         (0x00000020UL)
#define EFM_F1NWPRT1_F1NWPRT38_POS                     (6U)
#define EFM_F1NWPRT1_F1NWPRT38                         (0x00000040UL)
#define EFM_F1NWPRT1_F1NWPRT39_POS                     (7U)
#define EFM_F1NWPRT1_F1NWPRT39                         (0x00000080UL)
#define EFM_F1NWPRT1_F1NWPRT40_POS                     (8U)
#define EFM_F1NWPRT1_F1NWPRT40                         (0x00000100UL)
#define EFM_F1NWPRT1_F1NWPRT41_POS                     (9U)
#define EFM_F1NWPRT1_F1NWPRT41                         (0x00000200UL)
#define EFM_F1NWPRT1_F1NWPRT42_POS                     (10U)
#define EFM_F1NWPRT1_F1NWPRT42                         (0x00000400UL)
#define EFM_F1NWPRT1_F1NWPRT43_POS                     (11U)
#define EFM_F1NWPRT1_F1NWPRT43                         (0x00000800UL)
#define EFM_F1NWPRT1_F1NWPRT44_POS                     (12U)
#define EFM_F1NWPRT1_F1NWPRT44                         (0x00001000UL)
#define EFM_F1NWPRT1_F1NWPRT45_POS                     (13U)
#define EFM_F1NWPRT1_F1NWPRT45                         (0x00002000UL)
#define EFM_F1NWPRT1_F1NWPRT46_POS                     (14U)
#define EFM_F1NWPRT1_F1NWPRT46                         (0x00004000UL)
#define EFM_F1NWPRT1_F1NWPRT47_POS                     (15U)
#define EFM_F1NWPRT1_F1NWPRT47                         (0x00008000UL)
#define EFM_F1NWPRT1_F1NWPRT48_POS                     (16U)
#define EFM_F1NWPRT1_F1NWPRT48                         (0x00010000UL)
#define EFM_F1NWPRT1_F1NWPRT49_POS                     (17U)
#define EFM_F1NWPRT1_F1NWPRT49                         (0x00020000UL)
#define EFM_F1NWPRT1_F1NWPRT50_POS                     (18U)
#define EFM_F1NWPRT1_F1NWPRT50                         (0x00040000UL)
#define EFM_F1NWPRT1_F1NWPRT51_POS                     (19U)
#define EFM_F1NWPRT1_F1NWPRT51                         (0x00080000UL)
#define EFM_F1NWPRT1_F1NWPRT52_POS                     (20U)
#define EFM_F1NWPRT1_F1NWPRT52                         (0x00100000UL)
#define EFM_F1NWPRT1_F1NWPRT53_POS                     (21U)
#define EFM_F1NWPRT1_F1NWPRT53                         (0x00200000UL)
#define EFM_F1NWPRT1_F1NWPRT54_POS                     (22U)
#define EFM_F1NWPRT1_F1NWPRT54                         (0x00400000UL)
#define EFM_F1NWPRT1_F1NWPRT55_POS                     (23U)
#define EFM_F1NWPRT1_F1NWPRT55                         (0x00800000UL)
#define EFM_F1NWPRT1_F1NWPRT56_POS                     (24U)
#define EFM_F1NWPRT1_F1NWPRT56                         (0x01000000UL)
#define EFM_F1NWPRT1_F1NWPRT57_POS                     (25U)
#define EFM_F1NWPRT1_F1NWPRT57                         (0x02000000UL)
#define EFM_F1NWPRT1_F1NWPRT58_POS                     (26U)
#define EFM_F1NWPRT1_F1NWPRT58                         (0x04000000UL)
#define EFM_F1NWPRT1_F1NWPRT59_POS                     (27U)
#define EFM_F1NWPRT1_F1NWPRT59                         (0x08000000UL)
#define EFM_F1NWPRT1_F1NWPRT60_POS                     (28U)
#define EFM_F1NWPRT1_F1NWPRT60                         (0x10000000UL)
#define EFM_F1NWPRT1_F1NWPRT61_POS                     (29U)
#define EFM_F1NWPRT1_F1NWPRT61                         (0x20000000UL)
#define EFM_F1NWPRT1_F1NWPRT62_POS                     (30U)
#define EFM_F1NWPRT1_F1NWPRT62                         (0x40000000UL)
#define EFM_F1NWPRT1_F1NWPRT63_POS                     (31U)
#define EFM_F1NWPRT1_F1NWPRT63                         (0x80000000UL)

/*  Bit definition for EFM_F1NWPRT2 register  */
#define EFM_F1NWPRT2_F1NWPRT64_POS                     (0U)
#define EFM_F1NWPRT2_F1NWPRT64                         (0x00000001UL)
#define EFM_F1NWPRT2_F1NWPRT65_POS                     (1U)
#define EFM_F1NWPRT2_F1NWPRT65                         (0x00000002UL)
#define EFM_F1NWPRT2_F1NWPRT66_POS                     (2U)
#define EFM_F1NWPRT2_F1NWPRT66                         (0x00000004UL)
#define EFM_F1NWPRT2_F1NWPRT67_POS                     (3U)
#define EFM_F1NWPRT2_F1NWPRT67                         (0x00000008UL)
#define EFM_F1NWPRT2_F1NWPRT68_POS                     (4U)
#define EFM_F1NWPRT2_F1NWPRT68                         (0x00000010UL)
#define EFM_F1NWPRT2_F1NWPRT69_POS                     (5U)
#define EFM_F1NWPRT2_F1NWPRT69                         (0x00000020UL)
#define EFM_F1NWPRT2_F1NWPRT70_POS                     (6U)
#define EFM_F1NWPRT2_F1NWPRT70                         (0x00000040UL)
#define EFM_F1NWPRT2_F1NWPRT71_POS                     (7U)
#define EFM_F1NWPRT2_F1NWPRT71                         (0x00000080UL)
#define EFM_F1NWPRT2_F1NWPRT72_POS                     (8U)
#define EFM_F1NWPRT2_F1NWPRT72                         (0x00000100UL)
#define EFM_F1NWPRT2_F1NWPRT73_POS                     (9U)
#define EFM_F1NWPRT2_F1NWPRT73                         (0x00000200UL)
#define EFM_F1NWPRT2_F1NWPRT74_POS                     (10U)
#define EFM_F1NWPRT2_F1NWPRT74                         (0x00000400UL)
#define EFM_F1NWPRT2_F1NWPRT75_POS                     (11U)
#define EFM_F1NWPRT2_F1NWPRT75                         (0x00000800UL)
#define EFM_F1NWPRT2_F1NWPRT76_POS                     (12U)
#define EFM_F1NWPRT2_F1NWPRT76                         (0x00001000UL)
#define EFM_F1NWPRT2_F1NWPRT77_POS                     (13U)
#define EFM_F1NWPRT2_F1NWPRT77                         (0x00002000UL)
#define EFM_F1NWPRT2_F1NWPRT78_POS                     (14U)
#define EFM_F1NWPRT2_F1NWPRT78                         (0x00004000UL)
#define EFM_F1NWPRT2_F1NWPRT79_POS                     (15U)
#define EFM_F1NWPRT2_F1NWPRT79                         (0x00008000UL)
#define EFM_F1NWPRT2_F1NWPRT80_POS                     (16U)
#define EFM_F1NWPRT2_F1NWPRT80                         (0x00010000UL)
#define EFM_F1NWPRT2_F1NWPRT81_POS                     (17U)
#define EFM_F1NWPRT2_F1NWPRT81                         (0x00020000UL)
#define EFM_F1NWPRT2_F1NWPRT82_POS                     (18U)
#define EFM_F1NWPRT2_F1NWPRT82                         (0x00040000UL)
#define EFM_F1NWPRT2_F1NWPRT83_POS                     (19U)
#define EFM_F1NWPRT2_F1NWPRT83                         (0x00080000UL)
#define EFM_F1NWPRT2_F1NWPRT84_POS                     (20U)
#define EFM_F1NWPRT2_F1NWPRT84                         (0x00100000UL)
#define EFM_F1NWPRT2_F1NWPRT85_POS                     (21U)
#define EFM_F1NWPRT2_F1NWPRT85                         (0x00200000UL)
#define EFM_F1NWPRT2_F1NWPRT86_POS                     (22U)
#define EFM_F1NWPRT2_F1NWPRT86                         (0x00400000UL)
#define EFM_F1NWPRT2_F1NWPRT87_POS                     (23U)
#define EFM_F1NWPRT2_F1NWPRT87                         (0x00800000UL)
#define EFM_F1NWPRT2_F1NWPRT88_POS                     (24U)
#define EFM_F1NWPRT2_F1NWPRT88                         (0x01000000UL)
#define EFM_F1NWPRT2_F1NWPRT89_POS                     (25U)
#define EFM_F1NWPRT2_F1NWPRT89                         (0x02000000UL)
#define EFM_F1NWPRT2_F1NWPRT90_POS                     (26U)
#define EFM_F1NWPRT2_F1NWPRT90                         (0x04000000UL)
#define EFM_F1NWPRT2_F1NWPRT91_POS                     (27U)
#define EFM_F1NWPRT2_F1NWPRT91                         (0x08000000UL)
#define EFM_F1NWPRT2_F1NWPRT92_POS                     (28U)
#define EFM_F1NWPRT2_F1NWPRT92                         (0x10000000UL)
#define EFM_F1NWPRT2_F1NWPRT93_POS                     (29U)
#define EFM_F1NWPRT2_F1NWPRT93                         (0x20000000UL)
#define EFM_F1NWPRT2_F1NWPRT94_POS                     (30U)
#define EFM_F1NWPRT2_F1NWPRT94                         (0x40000000UL)
#define EFM_F1NWPRT2_F1NWPRT95_POS                     (31U)
#define EFM_F1NWPRT2_F1NWPRT95                         (0x80000000UL)

/*  Bit definition for EFM_F1NWPRT3 register  */
#define EFM_F1NWPRT3_F1NWPRT96_POS                     (0U)
#define EFM_F1NWPRT3_F1NWPRT96                         (0x00000001UL)
#define EFM_F1NWPRT3_F1NWPRT97_POS                     (1U)
#define EFM_F1NWPRT3_F1NWPRT97                         (0x00000002UL)
#define EFM_F1NWPRT3_F1NWPRT98_POS                     (2U)
#define EFM_F1NWPRT3_F1NWPRT98                         (0x00000004UL)
#define EFM_F1NWPRT3_F1NWPRT99_POS                     (3U)
#define EFM_F1NWPRT3_F1NWPRT99                         (0x00000008UL)
#define EFM_F1NWPRT3_F1NWPRT100_POS                    (4U)
#define EFM_F1NWPRT3_F1NWPRT100                        (0x00000010UL)
#define EFM_F1NWPRT3_F1NWPRT101_POS                    (5U)
#define EFM_F1NWPRT3_F1NWPRT101                        (0x00000020UL)
#define EFM_F1NWPRT3_F1NWPRT102_POS                    (6U)
#define EFM_F1NWPRT3_F1NWPRT102                        (0x00000040UL)
#define EFM_F1NWPRT3_F1NWPRT103_POS                    (7U)
#define EFM_F1NWPRT3_F1NWPRT103                        (0x00000080UL)
#define EFM_F1NWPRT3_F1NWPRT104_POS                    (8U)
#define EFM_F1NWPRT3_F1NWPRT104                        (0x00000100UL)
#define EFM_F1NWPRT3_F1NWPRT105_POS                    (9U)
#define EFM_F1NWPRT3_F1NWPRT105                        (0x00000200UL)
#define EFM_F1NWPRT3_F1NWPRT106_POS                    (10U)
#define EFM_F1NWPRT3_F1NWPRT106                        (0x00000400UL)
#define EFM_F1NWPRT3_F1NWPRT107_POS                    (11U)
#define EFM_F1NWPRT3_F1NWPRT107                        (0x00000800UL)
#define EFM_F1NWPRT3_F1NWPRT108_POS                    (12U)
#define EFM_F1NWPRT3_F1NWPRT108                        (0x00001000UL)
#define EFM_F1NWPRT3_F1NWPRT109_POS                    (13U)
#define EFM_F1NWPRT3_F1NWPRT109                        (0x00002000UL)
#define EFM_F1NWPRT3_F1NWPRT110_POS                    (14U)
#define EFM_F1NWPRT3_F1NWPRT110                        (0x00004000UL)
#define EFM_F1NWPRT3_F1NWPRT111_POS                    (15U)
#define EFM_F1NWPRT3_F1NWPRT111                        (0x00008000UL)
#define EFM_F1NWPRT3_F1NWPRT112_POS                    (16U)
#define EFM_F1NWPRT3_F1NWPRT112                        (0x00010000UL)
#define EFM_F1NWPRT3_F1NWPRT113_POS                    (17U)
#define EFM_F1NWPRT3_F1NWPRT113                        (0x00020000UL)
#define EFM_F1NWPRT3_F1NWPRT114_POS                    (18U)
#define EFM_F1NWPRT3_F1NWPRT114                        (0x00040000UL)
#define EFM_F1NWPRT3_F1NWPRT115_POS                    (19U)
#define EFM_F1NWPRT3_F1NWPRT115                        (0x00080000UL)
#define EFM_F1NWPRT3_F1NWPRT116_POS                    (20U)
#define EFM_F1NWPRT3_F1NWPRT116                        (0x00100000UL)
#define EFM_F1NWPRT3_F1NWPRT117_POS                    (21U)
#define EFM_F1NWPRT3_F1NWPRT117                        (0x00200000UL)
#define EFM_F1NWPRT3_F1NWPRT118_POS                    (22U)
#define EFM_F1NWPRT3_F1NWPRT118                        (0x00400000UL)
#define EFM_F1NWPRT3_F1NWPRT119_POS                    (23U)
#define EFM_F1NWPRT3_F1NWPRT119                        (0x00800000UL)
#define EFM_F1NWPRT3_F1NWPRT120_POS                    (24U)
#define EFM_F1NWPRT3_F1NWPRT120                        (0x01000000UL)
#define EFM_F1NWPRT3_F1NWPRT121_POS                    (25U)
#define EFM_F1NWPRT3_F1NWPRT121                        (0x02000000UL)
#define EFM_F1NWPRT3_F1NWPRT122_POS                    (26U)
#define EFM_F1NWPRT3_F1NWPRT122                        (0x04000000UL)
#define EFM_F1NWPRT3_F1NWPRT123_POS                    (27U)
#define EFM_F1NWPRT3_F1NWPRT123                        (0x08000000UL)
#define EFM_F1NWPRT3_F1NWPRT124_POS                    (28U)
#define EFM_F1NWPRT3_F1NWPRT124                        (0x10000000UL)
#define EFM_F1NWPRT3_F1NWPRT125_POS                    (29U)
#define EFM_F1NWPRT3_F1NWPRT125                        (0x20000000UL)
#define EFM_F1NWPRT3_F1NWPRT126_POS                    (30U)
#define EFM_F1NWPRT3_F1NWPRT126                        (0x40000000UL)
#define EFM_F1NWPRT3_F1NWPRT127_POS                    (31U)
#define EFM_F1NWPRT3_F1NWPRT127                        (0x80000000UL)

