SoCXin/HC32F4A0/src/hc32f4a0pgtb_template/common/hc32f4a0pgtb.h
/*  Bit definition for FMAC_COR7 register  */
#define FMAC_COR7_CIN                                  (0x0000FFFFUL)

/*  Bit definition for FMAC_COR8 register  */
#define FMAC_COR8_CIN                                  (0x0000FFFFUL)

/*  Bit definition for FMAC_COR9 register  */
#define FMAC_COR9_CIN                                  (0x0000FFFFUL)

/*  Bit definition for FMAC_COR10 register  */
#define FMAC_COR10_CIN                                 (0x0000FFFFUL)

/*  Bit definition for FMAC_COR11 register  */
#define FMAC_COR11_CIN                                 (0x0000FFFFUL)

/*  Bit definition for FMAC_COR12 register  */
#define FMAC_COR12_CIN                                 (0x0000FFFFUL)

/*  Bit definition for FMAC_COR13 register  */
#define FMAC_COR13_CIN                                 (0x0000FFFFUL)

/*  Bit definition for FMAC_COR14 register  */
#define FMAC_COR14_CIN                                 (0x0000FFFFUL)

/*  Bit definition for FMAC_COR15 register  */
#define FMAC_COR15_CIN                                 (0x0000FFFFUL)

/*  Bit definition for FMAC_COR16 register  */
#define FMAC_COR16_CIN                                 (0x0000FFFFUL)

/*******************************************************************************
                Bit definition for Peripheral GPIO
*******************************************************************************/
/*  Bit definition for GPIO_PIDRA register  */
#define GPIO_PIDRA_PIN00_POS                           (0U)
#define GPIO_PIDRA_PIN00                               (0x0001U)
#define GPIO_PIDRA_PIN01_POS                           (1U)
#define GPIO_PIDRA_PIN01                               (0x0002U)
#define GPIO_PIDRA_PIN02_POS                           (2U)
#define GPIO_PIDRA_PIN02                               (0x0004U)
#define GPIO_PIDRA_PIN03_POS                           (3U)
#define GPIO_PIDRA_PIN03                               (0x0008U)
#define GPIO_PIDRA_PIN04_POS                           (4U)
#define GPIO_PIDRA_PIN04                               (0x0010U)
#define GPIO_PIDRA_PIN05_POS                           (5U)
#define GPIO_PIDRA_PIN05                               (0x0020U)
#define GPIO_PIDRA_PIN06_POS                           (6U)
#define GPIO_PIDRA_PIN06                               (0x0040U)
#define GPIO_PIDRA_PIN07_POS                           (7U)
#define GPIO_PIDRA_PIN07                               (0x0080U)
#define GPIO_PIDRA_PIN08_POS                           (8U)
#define GPIO_PIDRA_PIN08                               (0x0100U)
#define GPIO_PIDRA_PIN09_POS                           (9U)
#define GPIO_PIDRA_PIN09                               (0x0200U)
#define GPIO_PIDRA_PIN10_POS                           (10U)
#define GPIO_PIDRA_PIN10                               (0x0400U)
#define GPIO_PIDRA_PIN11_POS                           (11U)
#define GPIO_PIDRA_PIN11                               (0x0800U)
#define GPIO_PIDRA_PIN12_POS                           (12U)
#define GPIO_PIDRA_PIN12                               (0x1000U)
#define GPIO_PIDRA_PIN13_POS                           (13U)
#define GPIO_PIDRA_PIN13                               (0x2000U)
#define GPIO_PIDRA_PIN14_POS                           (14U)
#define GPIO_PIDRA_PIN14                               (0x4000U)
#define GPIO_PIDRA_PIN15_POS                           (15U)
#define GPIO_PIDRA_PIN15                               (0x8000U)

/*  Bit definition for GPIO_PODRA register  */
#define GPIO_PODRA_POUT00_POS                          (0U)
#define GPIO_PODRA_POUT00                              (0x0001U)
#define GPIO_PODRA_POUT01_POS                          (1U)
#define GPIO_PODRA_POUT01                              (0x0002U)
#define GPIO_PODRA_POUT02_POS                          (2U)
#define GPIO_PODRA_POUT02                              (0x0004U)
#define GPIO_PODRA_POUT03_POS                          (3U)
#define GPIO_PODRA_POUT03                              (0x0008U)
#define GPIO_PODRA_POUT04_POS                          (4U)
#define GPIO_PODRA_POUT04                              (0x0010U)
#define GPIO_PODRA_POUT05_POS                          (5U)
#define GPIO_PODRA_POUT05                              (0x0020U)
#define GPIO_PODRA_POUT06_POS                          (6U)
#define GPIO_PODRA_POUT06                              (0x0040U)
#define GPIO_PODRA_POUT07_POS                          (7U)
#define GPIO_PODRA_POUT07                              (0x0080U)
#define GPIO_PODRA_POUT08_POS                          (8U)
#define GPIO_PODRA_POUT08                              (0x0100U)
#define GPIO_PODRA_POUT09_POS                          (9U)
#define GPIO_PODRA_POUT09                              (0x0200U)
#define GPIO_PODRA_POUT10_POS                          (10U)
#define GPIO_PODRA_POUT10                              (0x0400U)
#define GPIO_PODRA_POUT11_POS                          (11U)
#define GPIO_PODRA_POUT11                              (0x0800U)
#define GPIO_PODRA_POUT12_POS                          (12U)
#define GPIO_PODRA_POUT12                              (0x1000U)
#define GPIO_PODRA_POUT13_POS                          (13U)
#define GPIO_PODRA_POUT13                              (0x2000U)
#define GPIO_PODRA_POUT14_POS                          (14U)
#define GPIO_PODRA_POUT14                              (0x4000U)
#define GPIO_PODRA_POUT15_POS                          (15U)
#define GPIO_PODRA_POUT15                              (0x8000U)

/*  Bit definition for GPIO_POERA register  */
#define GPIO_POERA_POUTE00_POS                         (0U)
#define GPIO_POERA_POUTE00                             (0x0001U)
#define GPIO_POERA_POUTE01_POS                         (1U)
#define GPIO_POERA_POUTE01                             (0x0002U)
#define GPIO_POERA_POUTE02_POS                         (2U)
#define GPIO_POERA_POUTE02                             (0x0004U)
#define GPIO_POERA_POUTE03_POS                         (3U)
#define GPIO_POERA_POUTE03                             (0x0008U)
#define GPIO_POERA_POUTE04_POS                         (4U)
#define GPIO_POERA_POUTE04                             (0x0010U)
#define GPIO_POERA_POUTE05_POS                         (5U)
#define GPIO_POERA_POUTE05                             (0x0020U)
#define GPIO_POERA_POUTE06_POS                         (6U)
#define GPIO_POERA_POUTE06                             (0x0040U)
#define GPIO_POERA_POUTE07_POS                         (7U)
#define GPIO_POERA_POUTE07                             (0x0080U)
#define GPIO_POERA_POUTE08_POS                         (8U)
#define GPIO_POERA_POUTE08                             (0x0100U)
#define GPIO_POERA_POUTE09_POS                         (9U)
#define GPIO_POERA_POUTE09                             (0x0200U)
#define GPIO_POERA_POUTE10_POS                         (10U)
#define GPIO_POERA_POUTE10                             (0x0400U)
#define GPIO_POERA_POUTE11_POS                         (11U)
#define GPIO_POERA_POUTE11                             (0x0800U)
#define GPIO_POERA_POUTE12_POS                         (12U)
#define GPIO_POERA_POUTE12                             (0x1000U)
#define GPIO_POERA_POUTE13_POS                         (13U)
#define GPIO_POERA_POUTE13                             (0x2000U)
#define GPIO_POERA_POUTE14_POS                         (14U)
#define GPIO_POERA_POUTE14                             (0x4000U)
#define GPIO_POERA_POUTE15_POS                         (15U)
#define GPIO_POERA_POUTE15                             (0x8000U)

/*  Bit definition for GPIO_POSRA register  */
#define GPIO_POSRA_POS00_POS                           (0U)
#define GPIO_POSRA_POS00                               (0x0001U)
#define GPIO_POSRA_POS01_POS                           (1U)
#define GPIO_POSRA_POS01                               (0x0002U)
#define GPIO_POSRA_POS02_POS                           (2U)
#define GPIO_POSRA_POS02                               (0x0004U)
#define GPIO_POSRA_POS03_POS                           (3U)
#define GPIO_POSRA_POS03                               (0x0008U)
#define GPIO_POSRA_POS04_POS                           (4U)
#define GPIO_POSRA_POS04                               (0x0010U)
#define GPIO_POSRA_POS05_POS                           (5U)
#define GPIO_POSRA_POS05                               (0x0020U)
#define GPIO_POSRA_POS06_POS                           (6U)
#define GPIO_POSRA_POS06                               (0x0040U)
#define GPIO_POSRA_POS07_POS                           (7U)
#define GPIO_POSRA_POS07                               (0x0080U)
#define GPIO_POSRA_POS08_POS                           (8U)
#define GPIO_POSRA_POS08                               (0x0100U)
#define GPIO_POSRA_POS09_POS                           (9U)
#define GPIO_POSRA_POS09                               (0x0200U)
#define GPIO_POSRA_POS10_POS                           (10U)
#define GPIO_POSRA_POS10                               (0x0400U)
#define GPIO_POSRA_POS11_POS                           (11U)
#define GPIO_POSRA_POS11                               (0x0800U)
#define GPIO_POSRA_POS12_POS                           (12U)
#define GPIO_POSRA_POS12                               (0x1000U)
#define GPIO_POSRA_POS13_POS                           (13U)
#define GPIO_POSRA_POS13                               (0x2000U)
#define GPIO_POSRA_POS14_POS                           (14U)
#define GPIO_POSRA_POS14                               (0x4000U)
#define GPIO_POSRA_POS15_POS                           (15U)
#define GPIO_POSRA_POS15                               (0x8000U)

