SoCXin/HC32F4A0/src/hc32f4a0pgtb_template/common/hc32f4a0pgtb.h
/*  Bit definition for INTC_SEL1 register  */
#define INTC_SEL1_INTSEL                               (0x000001FFUL)

/*  Bit definition for INTC_SEL2 register  */
#define INTC_SEL2_INTSEL                               (0x000001FFUL)

/*  Bit definition for INTC_SEL3 register  */
#define INTC_SEL3_INTSEL                               (0x000001FFUL)

/*  Bit definition for INTC_SEL4 register  */
#define INTC_SEL4_INTSEL                               (0x000001FFUL)

/*  Bit definition for INTC_SEL5 register  */
#define INTC_SEL5_INTSEL                               (0x000001FFUL)

/*  Bit definition for INTC_SEL6 register  */
#define INTC_SEL6_INTSEL                               (0x000001FFUL)

/*  Bit definition for INTC_SEL7 register  */
#define INTC_SEL7_INTSEL                               (0x000001FFUL)

/*  Bit definition for INTC_SEL8 register  */
#define INTC_SEL8_INTSEL                               (0x000001FFUL)

/*  Bit definition for INTC_SEL9 register  */
#define INTC_SEL9_INTSEL                               (0x000001FFUL)

/*  Bit definition for INTC_SEL10 register  */
#define INTC_SEL10_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL11 register  */
#define INTC_SEL11_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL12 register  */
#define INTC_SEL12_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL13 register  */
#define INTC_SEL13_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL14 register  */
#define INTC_SEL14_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL15 register  */
#define INTC_SEL15_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL16 register  */
#define INTC_SEL16_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL17 register  */
#define INTC_SEL17_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL18 register  */
#define INTC_SEL18_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL19 register  */
#define INTC_SEL19_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL20 register  */
#define INTC_SEL20_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL21 register  */
#define INTC_SEL21_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL22 register  */
#define INTC_SEL22_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL23 register  */
#define INTC_SEL23_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL24 register  */
#define INTC_SEL24_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL25 register  */
#define INTC_SEL25_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL26 register  */
#define INTC_SEL26_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL27 register  */
#define INTC_SEL27_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL28 register  */
#define INTC_SEL28_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL29 register  */
#define INTC_SEL29_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL30 register  */
#define INTC_SEL30_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL31 register  */
#define INTC_SEL31_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL32 register  */
#define INTC_SEL32_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL33 register  */
#define INTC_SEL33_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL34 register  */
#define INTC_SEL34_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL35 register  */
#define INTC_SEL35_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL36 register  */
#define INTC_SEL36_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL37 register  */
#define INTC_SEL37_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL38 register  */
#define INTC_SEL38_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL39 register  */
#define INTC_SEL39_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL40 register  */
#define INTC_SEL40_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL41 register  */
#define INTC_SEL41_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL42 register  */
#define INTC_SEL42_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL43 register  */
#define INTC_SEL43_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL44 register  */
#define INTC_SEL44_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL45 register  */
#define INTC_SEL45_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL46 register  */
#define INTC_SEL46_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL47 register  */
#define INTC_SEL47_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL48 register  */
#define INTC_SEL48_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL49 register  */
#define INTC_SEL49_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL50 register  */
#define INTC_SEL50_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL51 register  */
#define INTC_SEL51_INTSEL                              (0x000001FFUL)

