SoCXin/HC32F4A0/src/hc32f4a0pgtb_template/common/hc32f4a0pgtb.h
/*  Bit definition for NFC_ECC_SYND5_3 register  */
#define NFC_ECC_SYND5_3_S7_POS                         (0U)
#define NFC_ECC_SYND5_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND5_3_S8_POS                         (16U)
#define NFC_ECC_SYND5_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND6_0 register  */
#define NFC_ECC_SYND6_0_S1_POS                         (0U)
#define NFC_ECC_SYND6_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND6_0_S2_POS                         (16U)
#define NFC_ECC_SYND6_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND6_1 register  */
#define NFC_ECC_SYND6_1_S3_POS                         (0U)
#define NFC_ECC_SYND6_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND6_1_S3_0                           (0x00000001UL)
#define NFC_ECC_SYND6_1_S3_1                           (0x00000002UL)
#define NFC_ECC_SYND6_1_S3_2                           (0x00000004UL)
#define NFC_ECC_SYND6_1_S3_3                           (0x00000008UL)
#define NFC_ECC_SYND6_1_S3_4                           (0x00000010UL)
#define NFC_ECC_SYND6_1_S3_5                           (0x00000020UL)
#define NFC_ECC_SYND6_1_S3_6                           (0x00000040UL)
#define NFC_ECC_SYND6_1_S3_7                           (0x00000080UL)
#define NFC_ECC_SYND6_1_S3_8                           (0x00000100UL)
#define NFC_ECC_SYND6_1_S3_9                           (0x00000200UL)
#define NFC_ECC_SYND6_1_S3_10                          (0x00000400UL)
#define NFC_ECC_SYND6_1_S3_11                          (0x00000800UL)
#define NFC_ECC_SYND6_1_S3_12                          (0x00001000UL)
#define NFC_ECC_SYND6_1_S4_POS                         (16U)
#define NFC_ECC_SYND6_1_S4                             (0x1FFF0000UL)
#define NFC_ECC_SYND6_1_S4_0                           (0x00010000UL)
#define NFC_ECC_SYND6_1_S4_1                           (0x00020000UL)
#define NFC_ECC_SYND6_1_S4_2                           (0x00040000UL)
#define NFC_ECC_SYND6_1_S4_3                           (0x00080000UL)
#define NFC_ECC_SYND6_1_S4_4                           (0x00100000UL)
#define NFC_ECC_SYND6_1_S4_5                           (0x00200000UL)
#define NFC_ECC_SYND6_1_S4_6                           (0x00400000UL)
#define NFC_ECC_SYND6_1_S4_7                           (0x00800000UL)
#define NFC_ECC_SYND6_1_S4_8                           (0x01000000UL)
#define NFC_ECC_SYND6_1_S4_9                           (0x02000000UL)
#define NFC_ECC_SYND6_1_S4_10                          (0x04000000UL)
#define NFC_ECC_SYND6_1_S4_11                          (0x08000000UL)
#define NFC_ECC_SYND6_1_S4_12                          (0x10000000UL)
#define NFC_ECC_SYND6_1_RESV_POS                       (31U)
#define NFC_ECC_SYND6_1_RESV                           (0x80000000UL)

/*  Bit definition for NFC_ECC_SYND6_2 register  */
#define NFC_ECC_SYND6_2_S5_POS                         (0U)
#define NFC_ECC_SYND6_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND6_2_S6_POS                         (16U)
#define NFC_ECC_SYND6_2_S6                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND6_3 register  */
#define NFC_ECC_SYND6_3_S7_POS                         (0U)
#define NFC_ECC_SYND6_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND6_3_S8_POS                         (16U)
#define NFC_ECC_SYND6_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND7_0 register  */
#define NFC_ECC_SYND7_0_S1_POS                         (0U)
#define NFC_ECC_SYND7_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND7_0_S2_POS                         (16U)
#define NFC_ECC_SYND7_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND7_1 register  */
#define NFC_ECC_SYND7_1_S3_POS                         (0U)
#define NFC_ECC_SYND7_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND7_1_S4_POS                         (16U)
#define NFC_ECC_SYND7_1_S4                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND7_2 register  */
#define NFC_ECC_SYND7_2_S5_POS                         (0U)
#define NFC_ECC_SYND7_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND7_2_S6_POS                         (16U)
#define NFC_ECC_SYND7_2_S6                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND7_3 register  */
#define NFC_ECC_SYND7_3_S7_POS                         (0U)
#define NFC_ECC_SYND7_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND7_3_S8_POS                         (16U)
#define NFC_ECC_SYND7_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND8_0 register  */
#define NFC_ECC_SYND8_0_S1_POS                         (0U)
#define NFC_ECC_SYND8_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND8_0_S2_POS                         (16U)
#define NFC_ECC_SYND8_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND8_1 register  */
#define NFC_ECC_SYND8_1_S3_POS                         (0U)
#define NFC_ECC_SYND8_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND8_1_S4_POS                         (16U)
#define NFC_ECC_SYND8_1_S4                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND8_2 register  */
#define NFC_ECC_SYND8_2_S5_POS                         (0U)
#define NFC_ECC_SYND8_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND8_2_S6_POS                         (16U)
#define NFC_ECC_SYND8_2_S6                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND8_3 register  */
#define NFC_ECC_SYND8_3_S7_POS                         (0U)
#define NFC_ECC_SYND8_3_S7                             (0x00001FFFUL)
#define NFC_ECC_SYND8_3_S8_POS                         (16U)
#define NFC_ECC_SYND8_3_S8                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND9_0 register  */
#define NFC_ECC_SYND9_0_S1_POS                         (0U)
#define NFC_ECC_SYND9_0_S1                             (0x00001FFFUL)
#define NFC_ECC_SYND9_0_S2_POS                         (16U)
#define NFC_ECC_SYND9_0_S2                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND9_1 register  */
#define NFC_ECC_SYND9_1_S3_POS                         (0U)
#define NFC_ECC_SYND9_1_S3                             (0x00001FFFUL)
#define NFC_ECC_SYND9_1_S4_POS                         (16U)
#define NFC_ECC_SYND9_1_S4                             (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND9_2 register  */
#define NFC_ECC_SYND9_2_S5_POS                         (0U)
#define NFC_ECC_SYND9_2_S5                             (0x00001FFFUL)
#define NFC_ECC_SYND9_2_S6_POS                         (16U)
#define NFC_ECC_SYND9_2_S6                             (0x1FFF0000UL)

