SoCXin/HC32F4A0/src/hc32f4a0pgtb_template/common/hc32f4a0pgtb.h
typedef struct
{
    __IO uint32_t TMR6_1;
    __IO uint32_t TMR6_2;
    __IO uint32_t TMR6_3;
    __IO uint32_t TMR6_4;
    __IO uint32_t TMR6_5;
    __IO uint32_t TMR6_6;
    __IO uint32_t TMR6_7;
    __IO uint32_t TMR6_8;
    __IO uint32_t TMR4_1;
    __IO uint32_t TMR4_2;
    __IO uint32_t TMR4_3;
    __IO uint32_t HRPWM;
    __IO uint32_t TMR0_1;
    __IO uint32_t TMR0_2;
    uint32_t RESERVED0[1];
    __IO uint32_t EMB;
    __IO uint32_t TMR2_1;
    __IO uint32_t TMR2_2;
    __IO uint32_t TMR2_3;
    __IO uint32_t TMR2_4;
    __IO uint32_t TMRA_1;
    __IO uint32_t TMRA_2;
    __IO uint32_t TMRA_3;
    __IO uint32_t TMRA_4;
    __IO uint32_t TMRA_5;
    __IO uint32_t TMRA_6;
    __IO uint32_t TMRA_7;
    __IO uint32_t TMRA_8;
    __IO uint32_t TMRA_9;
    __IO uint32_t TMRA_10;
    __IO uint32_t TMRA_11;
    __IO uint32_t TMRA_12;
} stc_pwc_fcg2_bit_t;

typedef struct
{
    __IO uint32_t ADC1;
    __IO uint32_t ADC2;
    __IO uint32_t ADC3;
    __IO uint32_t CMBIAS;
    __IO uint32_t DAC1;
    __IO uint32_t DAC2;
    uint32_t RESERVED0[2];
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    uint32_t RESERVED1[2];
    __IO uint32_t OTS;
    uint32_t RESERVED2[2];
    __IO uint32_t DVP;
    __IO uint32_t SMC;
    __IO uint32_t DMC;
    __IO uint32_t NFC;
    uint32_t RESERVED3[1];
    __IO uint32_t USART1;
    __IO uint32_t USART2;
    __IO uint32_t USART3;
    __IO uint32_t USART4;
    __IO uint32_t USART5;
    __IO uint32_t USART6;
    __IO uint32_t USART7;
    __IO uint32_t USART8;
    __IO uint32_t USART9;
    __IO uint32_t USART10;
    uint32_t RESERVED4[2];
} stc_pwc_fcg3_bit_t;

typedef struct
{
    __IO uint32_t PRT0;
    uint32_t RESERVED0[31];
} stc_pwc_fcg0pc_bit_t;

typedef struct
{
    __IO uint32_t VBTRSD;
    __IO uint32_t RAMVALID;
    __IO uint32_t RAMPDF;
    __IO uint32_t VBATDIVMONE;
    uint32_t RESERVED0[3];
    __IO uint32_t CSDIS;
} stc_pwc_vbatcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_pwc_wktc0_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_pwc_wktc1_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t WKOVF;
    __IO uint32_t WKCKS0;
    __IO uint32_t WKCKS1;
    __IO uint32_t WKTCE;
} stc_pwc_wktc2_bit_t;

typedef struct
{
    __IO uint32_t PDMDS0;
    __IO uint32_t PDMDS1;
    uint32_t RESERVED0[2];
    __IO uint32_t IORTN0;
    __IO uint32_t IORTN1;
    uint32_t RESERVED1[1];
    __IO uint32_t PWDN;
} stc_pwc_pwrc0_bit_t;

typedef struct
{
    __IO uint32_t VPLLSD0;
    __IO uint32_t VPLLSD1;
    __IO uint32_t VHRCSD;
    __IO uint32_t PDTS;
    uint32_t RESERVED0[2];
    __IO uint32_t STPDAS0;
    __IO uint32_t STPDAS1;
} stc_pwc_pwrc1_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t DVS0;
    __IO uint32_t DVS1;
    uint32_t RESERVED1[2];
} stc_pwc_pwrc2_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_pwc_pwrc3_bit_t;

typedef struct
{
    __IO uint32_t VBATREFSEL;
    __IO uint32_t VBATME;
    uint32_t RESERVED0[2];
    __IO uint32_t VBATMON;
    uint32_t RESERVED1[1];
    __IO uint32_t ADBUFS;
    __IO uint32_t ADBUFE;
} stc_pwc_pwrc4_bit_t;

typedef struct
{
    __IO uint32_t EXVCCINEN;
    uint32_t RESERVED0[4];
    __IO uint32_t PVD1EN;
    __IO uint32_t PVD2EN;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr0_bit_t;

typedef struct
{
    __IO uint32_t PVD1IRE;
    __IO uint32_t PVD1IRS;
    __IO uint32_t PVD1CMPOE;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2IRE;
    __IO uint32_t PVD2IRS;
    __IO uint32_t PVD2CMPOE;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr1_bit_t;

typedef struct
{
    __IO uint32_t PVD1NFDIS;
    __IO uint32_t PVD1NFCKS0;
    __IO uint32_t PVD1NFCKS1;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2NFDIS;
    __IO uint32_t PVD2NFCKS0;
    __IO uint32_t PVD2NFCKS1;
    uint32_t RESERVED1[1];
} stc_pwc_pvdfcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_pwc_pvdlcr_bit_t;

typedef struct
{
    __IO uint32_t WKE00;
    __IO uint32_t WKE01;
    __IO uint32_t WKE02;
    __IO uint32_t WKE03;
    __IO uint32_t WKE10;
    __IO uint32_t WKE11;
    __IO uint32_t WKE12;
    __IO uint32_t WKE13;
} stc_pwc_pdwke0_bit_t;

typedef struct
{
    __IO uint32_t WKE20;
    __IO uint32_t WKE21;
    __IO uint32_t WKE22;
    __IO uint32_t WKE23;
    __IO uint32_t WKE30;
    __IO uint32_t WKE31;
    __IO uint32_t WKE32;
    __IO uint32_t WKE33;
} stc_pwc_pdwke1_bit_t;

typedef struct
{
    __IO uint32_t VD1WKE;
    __IO uint32_t VD2WKE;
    uint32_t RESERVED0[2];
    __IO uint32_t RTCPRDWKE;
    __IO uint32_t RTCALMWKE;
    uint32_t RESERVED1[1];
    __IO uint32_t WKTMWKE;
} stc_pwc_pdwke2_bit_t;

typedef struct
{
    __IO uint32_t WK0EGS;
    __IO uint32_t WK1EGS;
    __IO uint32_t WK2EGS;
    __IO uint32_t WK3EGS;
    __IO uint32_t VD1EGS;
    __IO uint32_t VD2EGS;
    uint32_t RESERVED0[2];
} stc_pwc_pdwkes_bit_t;

typedef struct
{
    __IO uint32_t PTWK0F;
    __IO uint32_t PTWK1F;
    __IO uint32_t PTWK2F;
    __IO uint32_t PTWK3F;
    __IO uint32_t VD1WKF;
    __IO uint32_t VD2WKF;
    uint32_t RESERVED0[2];
} stc_pwc_pdwkf0_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t RXD0WKF;
    __IO uint32_t RTCPRDWKF;
    __IO uint32_t RTCALMWKF;
    uint32_t RESERVED1[1];
    __IO uint32_t WKTMWKF;
} stc_pwc_pdwkf1_bit_t;

typedef struct
{
    __IO uint32_t RAMPDC0;
    __IO uint32_t RAMPDC1;
    __IO uint32_t RAMPDC2;
    __IO uint32_t RAMPDC3;
    __IO uint32_t RAMPDC4;
    __IO uint32_t RAMPDC5;
    __IO uint32_t RAMPDC6;
    __IO uint32_t RAMPDC7;
    __IO uint32_t RAMPDC8;
    __IO uint32_t RAMPDC9;
    __IO uint32_t RAMPDC10;
    uint32_t RESERVED0[21];
} stc_pwc_rampc0_bit_t;

typedef struct
{
    __IO uint32_t PRAMPDC0;
    __IO uint32_t PRAMPDC1;
    __IO uint32_t PRAMPDC2;
    __IO uint32_t PRAMPDC3;
    __IO uint32_t PRAMPDC4;
    __IO uint32_t PRAMPDC5;
    __IO uint32_t PRAMPDC6;
    __IO uint32_t PRAMPDC7;
    __IO uint32_t PRAMPDC8;
    __IO uint32_t PRAMPDC9;
    uint32_t RESERVED0[22];
} stc_pwc_pramlpc_bit_t;

typedef struct
{
    __IO uint32_t PVD1NMIS;
    __IO uint32_t PVD1EDGS0;
    __IO uint32_t PVD1EDGS1;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2NMIS;
    __IO uint32_t PVD2EDGS0;
    __IO uint32_t PVD2EDGS1;
    uint32_t RESERVED1[1];
} stc_pwc_pvdicr_bit_t;

typedef struct
{
    __IO uint32_t PVD1MON;
    __IO uint32_t PVD1DETFLG;
    uint32_t RESERVED0[2];
    __IO uint32_t PVD2MON;
    __IO uint32_t PVD2DETFLG;
    uint32_t RESERVED1[2];
} stc_pwc_pvddsr_bit_t;

typedef struct
{
    __IO uint32_t FLNWT;
    __IO uint32_t CKSMRC;
    uint32_t RESERVED0[12];
    __IO uint32_t EXBUSOE;
    __IO uint32_t STOP;
} stc_pwc_stpmcr_bit_t;

typedef struct
{
    __IO uint32_t FPRCB0;
    __IO uint32_t FPRCB1;
    __IO uint32_t FPRCB2;
    __IO uint32_t FPRCB3;
    uint32_t RESERVED0[12];
} stc_pwc_fprc_bit_t;

typedef struct
{
    uint32_t RESERVED0[5];
    __IO uint32_t LKUPREN;
    uint32_t RESERVED1[2];
} stc_rmu_prstcr0_bit_t;

typedef struct
{
    __IO uint32_t PORF;
    __IO uint32_t PINRF;
    __IO uint32_t BORF;
    __IO uint32_t PVD1RF;
    __IO uint32_t PVD2RF;
    __IO uint32_t WDRF;
    __IO uint32_t SWDRF;
    __IO uint32_t PDRF;
    __IO uint32_t SWRF;
    __IO uint32_t MPUERF;
    __IO uint32_t RAPERF;
    __IO uint32_t RAECRF;
    __IO uint32_t CKFERF;
    __IO uint32_t XTALERF;
    __IO uint32_t LKUPRF;
    uint32_t RESERVED0[15];
    __IO uint32_t MULTIRF;
    __IO uint32_t CLRF;
} stc_rmu_rstf0_bit_t;

typedef struct
{
    __IO uint32_t RESET;
    uint32_t RESERVED0[7];
} stc_rtc_cr0_bit_t;

typedef struct
{
    __IO uint32_t PRDS0;
    __IO uint32_t PRDS1;
    __IO uint32_t PRDS2;
    __IO uint32_t AMPM;
    uint32_t RESERVED0[1];
    __IO uint32_t ONEHZOE;
    __IO uint32_t ONEHZSEL;
    __IO uint32_t START;
} stc_rtc_cr1_bit_t;

typedef struct
{
    __IO uint32_t RWREQ;
    __IO uint32_t RWEN;
    __IO uint32_t PRDF;
    __IO uint32_t ALMF;
    uint32_t RESERVED0[1];
    __IO uint32_t PRDIE;
    __IO uint32_t ALMIE;
    __IO uint32_t ALME;
} stc_rtc_cr2_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t LRCEN;
    uint32_t RESERVED1[2];
    __IO uint32_t RCKSEL;
} stc_rtc_cr3_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_sec_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_min_bit_t;

typedef struct
{
    __IO uint32_t HOURU0;
    __IO uint32_t HOURU1;
    __IO uint32_t HOURU2;
    __IO uint32_t HOURU3;
    __IO uint32_t HOURD0;
    __IO uint32_t HOURD1;
    uint32_t RESERVED0[2];
} stc_rtc_hour_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_week_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_day_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_mon_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_year_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_almmin_bit_t;

typedef struct
{
    __IO uint32_t ALMHOURU0;
    __IO uint32_t ALMHOURU1;
    __IO uint32_t ALMHOURU2;
    __IO uint32_t ALMHOURU3;
    __IO uint32_t ALMHOURD0;
    __IO uint32_t ALMHOURD1;
    uint32_t RESERVED0[2];
} stc_rtc_almhour_bit_t;

typedef struct
{
    __IO uint32_t ALMWEEK0;
    __IO uint32_t ALMWEEK1;
    __IO uint32_t ALMWEEK2;
    __IO uint32_t ALMWEEK3;
    __IO uint32_t ALMWEEK4;
    __IO uint32_t ALMWEEK5;
    __IO uint32_t ALMWEEK6;
    uint32_t RESERVED0[1];
} stc_rtc_almweek_bit_t;

typedef struct
{
    __IO uint32_t COMP8;
    uint32_t RESERVED0[6];
    __IO uint32_t COMPEN;
} stc_rtc_errcrh_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_errcrl_bit_t;

typedef struct
{
    __IO uint32_t TPCT00;
    __IO uint32_t TPCT01;
    __IO uint32_t TPNF00;
    __IO uint32_t TPNF01;
    __IO uint32_t TPRSTE0;
    __IO uint32_t TPIE0;
    __IO uint32_t TSTPE0;
    __IO uint32_t TPEN0;
} stc_rtc_tpcr0_bit_t;

typedef struct
{
    __IO uint32_t TPCT10;
    __IO uint32_t TPCT11;
    __IO uint32_t TPNF10;
    __IO uint32_t TPNF11;
    __IO uint32_t TPRSTE1;
    __IO uint32_t TPIE1;
    __IO uint32_t TSTPE1;
    __IO uint32_t TPEN1;
} stc_rtc_tpcr1_bit_t;

typedef struct
{
    __IO uint32_t TPF0;
    __IO uint32_t TPF1;
    __IO uint32_t TPOVF;
    uint32_t RESERVED0[5];
} stc_rtc_tpsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_sectp_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_mintp_bit_t;

typedef struct
{
    __IO uint32_t HOURTPU0;
    __IO uint32_t HOURTPU1;
    __IO uint32_t HOURTPU2;
    __IO uint32_t HOURTPU3;
    __IO uint32_t HOURTPD0;
    __IO uint32_t HOURTPD1;
    uint32_t RESERVED0[2];
} stc_rtc_hourtp_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_daytp_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_rtc_montp_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_sdioc_blksize_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t BCE;
    __IO uint32_t ATCEN0;
    __IO uint32_t ATCEN1;
    __IO uint32_t DDIR;
    __IO uint32_t MULB;
    uint32_t RESERVED1[10];
} stc_sdioc_transmode_bit_t;

typedef struct
{
    __IO uint32_t RESTYP0;
    __IO uint32_t RESTYP1;
    uint32_t RESERVED0[1];
    __IO uint32_t CCE;
    __IO uint32_t ICE;
    __IO uint32_t DAT;
    __IO uint32_t TYP0;
    __IO uint32_t TYP1;
    __IO uint32_t IDX0;
    __IO uint32_t IDX1;
    __IO uint32_t IDX2;
    __IO uint32_t IDX3;
    __IO uint32_t IDX4;
    __IO uint32_t IDX5;
    uint32_t RESERVED1[2];
} stc_sdioc_cmd_bit_t;

typedef struct
{
    __IO uint32_t CIC;
    __IO uint32_t CID;
    __IO uint32_t DA;
    uint32_t RESERVED0[5];
    __IO uint32_t WTA;
    __IO uint32_t RTA;
    __IO uint32_t BWE;
    __IO uint32_t BRE;
    uint32_t RESERVED1[4];
    __IO uint32_t CIN;
    __IO uint32_t CSS;
    __IO uint32_t CDL;
    __IO uint32_t WPL;
    __IO uint32_t DATL0;
    __IO uint32_t DATL1;
    __IO uint32_t DATL2;
    __IO uint32_t DATL3;
    __IO uint32_t CMDL;
    uint32_t RESERVED2[7];
} stc_sdioc_pstat_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t DW;
    __IO uint32_t HSEN;
    uint32_t RESERVED1[2];
    __IO uint32_t EXDW;
    __IO uint32_t CDTL;
    __IO uint32_t CDSS;
} stc_sdioc_hostcon_bit_t;

typedef struct
{
    __IO uint32_t PWON;
    uint32_t RESERVED0[7];
} stc_sdioc_pwrcon_bit_t;

typedef struct
{
    __IO uint32_t SABGR;
    __IO uint32_t CR;
    __IO uint32_t RWC;
    __IO uint32_t IABG;
    uint32_t RESERVED0[4];
} stc_sdioc_blkgpcon_bit_t;

typedef struct
{
    __IO uint32_t ICE;
    uint32_t RESERVED0[1];
    __IO uint32_t CE;
    uint32_t RESERVED1[5];
    __IO uint32_t FS0;
    __IO uint32_t FS1;
    __IO uint32_t FS2;
    __IO uint32_t FS3;
    __IO uint32_t FS4;
    __IO uint32_t FS5;
    __IO uint32_t FS6;
    __IO uint32_t FS7;
} stc_sdioc_clkcon_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_sdioc_toutcon_bit_t;

typedef struct
{
    __IO uint32_t RSTA;
    __IO uint32_t RSTC;
    __IO uint32_t RSTD;
    uint32_t RESERVED0[5];
} stc_sdioc_sftrst_bit_t;

typedef struct
{
    __IO uint32_t CC;
    __IO uint32_t TC;
    __IO uint32_t BGE;
    uint32_t RESERVED0[1];
    __IO uint32_t BWR;
    __IO uint32_t BRR;
    __IO uint32_t CIST;
    __IO uint32_t CRM;
    __IO uint32_t CINT;
    uint32_t RESERVED1[6];
    __IO uint32_t EI;
} stc_sdioc_norintst_bit_t;

typedef struct
{
    __IO uint32_t CTOE;
    __IO uint32_t CCE;
    __IO uint32_t CEBE;
    __IO uint32_t CIE;
    __IO uint32_t DTOE;
    __IO uint32_t DCE;
    __IO uint32_t DEBE;
    uint32_t RESERVED0[1];
    __IO uint32_t ACE;
    uint32_t RESERVED1[7];
} stc_sdioc_errintst_bit_t;

typedef struct
{
    __IO uint32_t CCEN;
    __IO uint32_t TCEN;
    __IO uint32_t BGEEN;
    uint32_t RESERVED0[1];
    __IO uint32_t BWREN;
    __IO uint32_t BRREN;
    __IO uint32_t CISTEN;
    __IO uint32_t CRMEN;
    __IO uint32_t CINTEN;
    uint32_t RESERVED1[7];
} stc_sdioc_norintsten_bit_t;

typedef struct
{
    __IO uint32_t CTOEEN;
    __IO uint32_t CCEEN;
    __IO uint32_t CEBEEN;
    __IO uint32_t CIEEN;
    __IO uint32_t DTOEEN;
    __IO uint32_t DCEEN;
    __IO uint32_t DEBEEN;
    uint32_t RESERVED0[1];
    __IO uint32_t ACEEN;
    uint32_t RESERVED1[7];
} stc_sdioc_errintsten_bit_t;

typedef struct
{
    __IO uint32_t CCSEN;
    __IO uint32_t TCSEN;
    __IO uint32_t BGESEN;
    uint32_t RESERVED0[1];
    __IO uint32_t BWRSEN;
    __IO uint32_t BRRSEN;
    __IO uint32_t CISTSEN;
    __IO uint32_t CRMSEN;
    __IO uint32_t CINTSEN;
    uint32_t RESERVED1[7];
} stc_sdioc_norintsgen_bit_t;

typedef struct
{
    __IO uint32_t CTOESEN;
    __IO uint32_t CCESEN;
    __IO uint32_t CEBESEN;
    __IO uint32_t CIESEN;
    __IO uint32_t DTOESEN;
    __IO uint32_t DCESEN;
    __IO uint32_t DEBESEN;
    uint32_t RESERVED0[1];
    __IO uint32_t ACESEN;
    uint32_t RESERVED1[7];
} stc_sdioc_errintsgen_bit_t;

typedef struct
{
    __IO uint32_t NE;
    __IO uint32_t TOE;
    __IO uint32_t CE;
    __IO uint32_t EBE;
    __IO uint32_t IE;
    uint32_t RESERVED0[2];
    __IO uint32_t CMDE;
    uint32_t RESERVED1[8];
} stc_sdioc_atcerrst_bit_t;

typedef struct
{
    __IO uint32_t FNE;
    __IO uint32_t FTOE;
    __IO uint32_t FCE;
    __IO uint32_t FEBE;
    __IO uint32_t FIE;
    uint32_t RESERVED0[2];
    __IO uint32_t FCMDE;
    uint32_t RESERVED1[8];
} stc_sdioc_fea_bit_t;

typedef struct
{
    __IO uint32_t FCTOE;
    __IO uint32_t FCCE;
    __IO uint32_t FCEBE;
    __IO uint32_t FCIE;
    __IO uint32_t FDTOE;
    __IO uint32_t FDCE;
    __IO uint32_t FDEBE;
    uint32_t RESERVED0[1];
    __IO uint32_t FACE;
    uint32_t RESERVED1[7];
} stc_sdioc_fee_bit_t;

typedef struct
{
    __IO uint32_t SPIMDS;
    __IO uint32_t TXMDS;
    uint32_t RESERVED0[1];
    __IO uint32_t MSTR;
    __IO uint32_t SPLPBK;
    __IO uint32_t SPLPBK2;
    __IO uint32_t SPE;
    __IO uint32_t CSUSPE;
    __IO uint32_t EIE;
    __IO uint32_t TXIE;
    __IO uint32_t RXIE;
    __IO uint32_t IDIE;
    __IO uint32_t MODFE;
    __IO uint32_t PATE;
    __IO uint32_t PAOE;
    __IO uint32_t PAE;
    uint32_t RESERVED1[16];
} stc_spi_cr1_bit_t;

typedef struct
{
    __IO uint32_t FTHLV0;
    __IO uint32_t FTHLV1;
    uint32_t RESERVED0[4];
    __IO uint32_t SPRDTD;
    uint32_t RESERVED1[1];
    __IO uint32_t SS0PV;
    __IO uint32_t SS1PV;
    __IO uint32_t SS2PV;
    __IO uint32_t SS3PV;
    uint32_t RESERVED2[8];
    __IO uint32_t MSSI0;
    __IO uint32_t MSSI1;
    __IO uint32_t MSSI2;
    uint32_t RESERVED3[1];
    __IO uint32_t MSSDL0;
    __IO uint32_t MSSDL1;
    __IO uint32_t MSSDL2;
    uint32_t RESERVED4[1];
    __IO uint32_t MIDI0;
    __IO uint32_t MIDI1;
    __IO uint32_t MIDI2;
    uint32_t RESERVED5[1];
} stc_spi_cfg1_bit_t;

typedef struct
{
    __IO uint32_t OVRERF;
    __IO uint32_t IDLNF;
    __IO uint32_t MODFERF;
    __IO uint32_t PERF;
    __IO uint32_t UDRERF;
    __IO uint32_t TDEF;
    uint32_t RESERVED0[1];
    __IO uint32_t RDFF;
    uint32_t RESERVED1[24];
} stc_spi_sr_bit_t;

typedef struct
{
    __IO uint32_t CPHA;
    __IO uint32_t CPOL;
    __IO uint32_t MBR0;
    __IO uint32_t MBR1;
    __IO uint32_t MBR2;
    __IO uint32_t SSA0;
    __IO uint32_t SSA1;
    __IO uint32_t SSA2;
    __IO uint32_t DSIZE0;
    __IO uint32_t DSIZE1;
    __IO uint32_t DSIZE2;
    __IO uint32_t DSIZE3;
    __IO uint32_t LSBF;
    __IO uint32_t MIDIE;
    __IO uint32_t MSSDLE;
    __IO uint32_t MSSIE;
    uint32_t RESERVED0[16];
} stc_spi_cfg2_bit_t;

typedef struct
{
    __IO uint32_t WTPRC;
    uint32_t RESERVED0[31];
} stc_sramc_wtpr_bit_t;

typedef struct
{
    __IO uint32_t PYOAD;
    uint32_t RESERVED0[15];
    __IO uint32_t ECCOAD;
    __IO uint32_t BECCOAD;
    uint32_t RESERVED1[6];
    __IO uint32_t ECCMOD0;
    __IO uint32_t ECCMOD1;
    __IO uint32_t BECCMOD0;
    __IO uint32_t BECCMOD1;
    uint32_t RESERVED2[4];
} stc_sramc_ckcr_bit_t;

typedef struct
{
    __IO uint32_t CKPRC;
    uint32_t RESERVED0[31];
} stc_sramc_ckpr_bit_t;

typedef struct
{
    __IO uint32_t SRAM1_PYERR;
    __IO uint32_t SRAM2_PYERR;
    __IO uint32_t SRAM3_PYERR;
    __IO uint32_t SRAMH_PYERR;
    __IO uint32_t SRAM4_1ERR;
    __IO uint32_t SRAM4_2ERR;
    __IO uint32_t SRAMB_1ERR;
    __IO uint32_t SRAMB_2ERR;
    __IO uint32_t CACHE_PYERR;
    uint32_t RESERVED0[23];
} stc_sramc_cksr_bit_t;

typedef struct
{
    __IO uint32_t PERI0;
    __IO uint32_t PERI1;
    uint32_t RESERVED0[2];
    __IO uint32_t CKS0;
    __IO uint32_t CKS1;
    __IO uint32_t CKS2;
    __IO uint32_t CKS3;
    __IO uint32_t WDPT0;
    __IO uint32_t WDPT1;
    __IO uint32_t WDPT2;
    __IO uint32_t WDPT3;
    uint32_t RESERVED1[4];
    __IO uint32_t SLPOFF;
    uint32_t RESERVED2[14];
    __IO uint32_t ITS;
} stc_swdt_cr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t UDF;
    __IO uint32_t REF;
    uint32_t RESERVED1[14];
} stc_swdt_sr_bit_t;

typedef struct
{
    __IO uint32_t CSTA;
    __IO uint32_t CAPMDA;
    __IO uint32_t INTENA;
    uint32_t RESERVED0[5];
    __IO uint32_t SYNSA;
    __IO uint32_t SYNCLKA;
    __IO uint32_t ASYNCLKA;
    uint32_t RESERVED1[1];
    __IO uint32_t HSTAA;
    __IO uint32_t HSTPA;
    __IO uint32_t HCLEA;
    __IO uint32_t HICPA;
    __IO uint32_t CSTB;
    __IO uint32_t CAPMDB;
    __IO uint32_t INTENB;
    uint32_t RESERVED2[5];
    __IO uint32_t SYNSB;
    __IO uint32_t SYNCLKB;
    __IO uint32_t ASYNCLKB;
    uint32_t RESERVED3[1];
    __IO uint32_t HSTAB;
    __IO uint32_t HSTPB;
    __IO uint32_t HCLEB;
    __IO uint32_t HICPB;
} stc_tmr0_bconr_bit_t;

typedef struct
{
    __IO uint32_t CMFA;
    uint32_t RESERVED0[15];
    __IO uint32_t CMFB;
    uint32_t RESERVED1[15];
} stc_tmr0_stflr_bit_t;

typedef struct
{
    __IO uint32_t CSTA;
    __IO uint32_t CAPMDA;
    uint32_t RESERVED0[1];
    __IO uint32_t SYNSA;
    uint32_t RESERVED1[4];
    __IO uint32_t SYNCLKA0;
    __IO uint32_t SYNCLKA1;
    __IO uint32_t ASYNCLKA0;
    __IO uint32_t ASYNCLKA1;
    __IO uint32_t SYNCLKAT0;
    __IO uint32_t SYNCLKAT1;
    uint32_t RESERVED2[2];
    __IO uint32_t CSTB;
    __IO uint32_t CAPMDB;
    uint32_t RESERVED3[1];
    __IO uint32_t SYNSB;
    uint32_t RESERVED4[4];
    __IO uint32_t SYNCLKB0;
    __IO uint32_t SYNCLKB1;
    __IO uint32_t ASYNCLKB0;
    __IO uint32_t ASYNCLKB1;
    __IO uint32_t SYNCLKBT0;
    __IO uint32_t SYNCLKBT1;
    uint32_t RESERVED5[2];
} stc_tmr2_bconr_bit_t;

typedef struct
{
    __IO uint32_t CMENA;
    __IO uint32_t OVENA;
    uint32_t RESERVED0[14];
    __IO uint32_t CMENB;
    __IO uint32_t OVENB;
    uint32_t RESERVED1[6];
    __IO uint32_t RESV;
    uint32_t RESERVED2[7];
} stc_tmr2_iconr_bit_t;

typedef struct
{
    __IO uint32_t STACA0;
    __IO uint32_t STACA1;
    __IO uint32_t STPCA0;
    __IO uint32_t STPCA1;
    __IO uint32_t CMPCA0;
    __IO uint32_t CMPCA1;
    uint32_t RESERVED0[2];
    __IO uint32_t OUTENA;
    uint32_t RESERVED1[3];
    __IO uint32_t NOFIENA;
    __IO uint32_t NOFICKA0;
    __IO uint32_t NOFICKA1;
    uint32_t RESERVED2[1];
    __IO uint32_t STACB0;
    __IO uint32_t STACB1;
    __IO uint32_t STPCB0;
    __IO uint32_t STPCB1;
    __IO uint32_t CMPCB0;
    __IO uint32_t CMPCB1;
    uint32_t RESERVED3[2];
    __IO uint32_t OUTENB;
    uint32_t RESERVED4[3];
    __IO uint32_t NOFIENB;
    __IO uint32_t NOFICKB0;
    __IO uint32_t NOFICKB1;
    uint32_t RESERVED5[1];
} stc_tmr2_pconr_bit_t;

typedef struct
{
    __IO uint32_t HSTAA0;
    __IO uint32_t HSTAA1;
    __IO uint32_t HSTAA2;
    uint32_t RESERVED0[1];
    __IO uint32_t HSTPA0;
    __IO uint32_t HSTPA1;
    __IO uint32_t HSTPA2;
    uint32_t RESERVED1[1];
    __IO uint32_t HCLEA0;
    __IO uint32_t HCLEA1;
    __IO uint32_t HCLEA2;
    uint32_t RESERVED2[1];
    __IO uint32_t HICPA0;
    __IO uint32_t HICPA1;
    __IO uint32_t HICPA2;
    uint32_t RESERVED3[1];
    __IO uint32_t HSTAB0;
    __IO uint32_t HSTAB1;
    __IO uint32_t HSTAB2;
    uint32_t RESERVED4[1];
    __IO uint32_t HSTPB0;
    __IO uint32_t HSTPB1;
    __IO uint32_t HSTPB2;
    uint32_t RESERVED5[1];
    __IO uint32_t HCLEB0;
    __IO uint32_t HCLEB1;
    __IO uint32_t HCLEB2;
    uint32_t RESERVED6[1];
    __IO uint32_t HICPB0;
    __IO uint32_t HICPB1;
    __IO uint32_t HICPB2;
    uint32_t RESERVED7[1];
} stc_tmr2_hconr_bit_t;

typedef struct
{
    __IO uint32_t CMFA;
    __IO uint32_t OVFA;
    uint32_t RESERVED0[14];
    __IO uint32_t CMFB;
    __IO uint32_t OVFB;
    uint32_t RESERVED1[6];
    __IO uint32_t RESV;
    uint32_t RESERVED2[7];
} stc_tmr2_stflr_bit_t;

typedef struct
{
    __IO uint32_t OCEH;
    __IO uint32_t OCEL;
    __IO uint32_t OCPH;
    __IO uint32_t OCPL;
    __IO uint32_t OCIEH;
    __IO uint32_t OCIEL;
    __IO uint32_t OCFH;
    __IO uint32_t OCFL;
    uint32_t RESERVED0[8];
} stc_tmr4_ocsr_bit_t;

typedef struct
{
    __IO uint32_t CHBUFEN0;
    __IO uint32_t CHBUFEN1;
    __IO uint32_t CLBUFEN0;
    __IO uint32_t CLBUFEN1;
    __IO uint32_t MHBUFEN0;
    __IO uint32_t MHBUFEN1;
    __IO uint32_t MLBUFEN0;
    __IO uint32_t MLBUFEN1;
    __IO uint32_t LMCH;
    __IO uint32_t LMCL;
    __IO uint32_t LMMH;
    __IO uint32_t LMML;
    __IO uint32_t MCECH;
    __IO uint32_t MCECL;
    uint32_t RESERVED0[2];
} stc_tmr4_ocer_bit_t;

typedef struct
{
    __IO uint32_t OCFDCH;
    __IO uint32_t OCFPKH;
    __IO uint32_t OCFUCH;
    __IO uint32_t OCFZRH;
    __IO uint32_t OPDCH0;
    __IO uint32_t OPDCH1;
    __IO uint32_t OPPKH0;
    __IO uint32_t OPPKH1;
    __IO uint32_t OPUCH0;
    __IO uint32_t OPUCH1;
    __IO uint32_t OPZRH0;
    __IO uint32_t OPZRH1;
    __IO uint32_t OPNPKH0;
    __IO uint32_t OPNPKH1;
    __IO uint32_t OPNZRH0;
    __IO uint32_t OPNZRH1;
} stc_tmr4_ocmrh_bit_t;

